[
{"name": ["Alphabet Inc Class C"], "stock_Value": ["$138.84"], "time": ["Nov 24, 9:48:41 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$140.02"], "day_range": ["$138.67 - $139.68"], "volume": ["$85.57 - $142.38"], "market_segment": ["22.37M"], "info": "Alphabet Inc. is an American multinational technology conglomerate holding company headquartered in Mountain View, California. It was created through a restructuring of Google on October 2, 2015, and became the parent company of Google and several former Google subsidiaries. Alphabet is the world's third-largest technology company by revenue and one of the world's most valuable companies. It is considered one of the Big Five American information technology companies, alongside Amazon, Apple, Meta, and Microsoft. The establishment of Alphabet Inc. was prompted by a desire to make the core Google business \"cleaner and more accountable\" while allowing greater autonomy to group companies that operate in businesses other than Internet services. Founders Larry Page and Sergey Brin announced their resignation from their executive posts in December 2019, with the CEO role to be filled by Sundar Pichai, also the CEO of Google. Page and Brin remain employees, board members, and controlling shareholders of Alphabet Inc."},
{"name": ["Apple Inc"], "stock_Value": ["$189.88"], "time": ["Nov 24, 9:48:42 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$191.31"], "day_range": ["$189.80 - $190.90"], "volume": ["$124.17 - $198.23"], "market_segment": ["56.12M"], "info": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California. As of March 2023, Apple is the world's largest company by market capitalization, and with US$394.3 billion the largest technology company by 2022 revenue. As of June 2022, Apple is the fourth-largest personal computer vendor by unit sales; the largest manufacturing company by revenue; and the second-largest mobile phone manufacturer in the world. It is considered one of the Big Five American information technology companies, alongside Alphabet, Amazon, Meta, and Microsoft. Apple was founded as Apple Computer Company on April 1, 1976, by Steve Wozniak, Steve Jobs and Ronald Wayne to develop and sell Wozniak's Apple I personal computer. It was incorporated by Jobs and Wozniak as Apple Computer, Inc. in 1977. The company's second computer, the Apple II, became a best seller and one of the first mass-produced microcomputers. Apple went public in 1980 to instant financial success. The company developed computers featuring innovative graphical user interfaces, including the 1984 original Macintosh, announced that year in a critically acclaimed advertisement called \"1984\"."},
{"name": ["GameStop Corp"], "stock_Value": ["$12.25"], "time": ["Nov 24, 9:48:44 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$12.29"], "day_range": ["$12.18 - $12.29"], "volume": ["$11.83 - $27.87"], "market_segment": ["3.29M"], "info": "GameStop Corp. is an American video game, consumer electronics, and gaming merchandise retailer. The company is headquartered in Grapevine, Texas, and is the largest video game retailer worldwide. As of 28 January 2023, the company operates 4,413 stores including 2,949 in the United States, 216 in Canada, 419 in Australia and 829 in Europe under the GameStop, EB Games, EB Games Australia, Micromania-Zing, ThinkGeek and Zing Pop Culture brands. The company was founded in Dallas in 1984 as Babbage's, and took on its current name in 1999. The company's performance declined during the mid-to-late 2010s due to the shift of video game sales to online shopping and failed investments by GameStop in smartphone retail. In 2021, after retail investors noticed that the short interest well exceeded the float, the company's stock price skyrocketed. According to the SEC report, this volatility was only in part due to the shorts covering their positions, but mostly thanks to the massive buying power of retail investors. The company received significant media attention during January and February 2021 due to the volatility of its stock price in the GameStop short squeeze."},
{"name": ["Kraft Heinz Co"], "stock_Value": ["$34.86"], "time": ["Nov 24, 9:48:48 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$34.68"], "day_range": ["$34.76 - $34.92"], "volume": ["$30.68 - $42.80"], "market_segment": ["7.62M"], "info": "The Kraft Heinz Company, commonly known as Kraft Heinz, is an American multinational food company formed by the merger of Kraft Foods and H.J. Heinz Company co-headquartered in Chicago and Pittsburgh. Kraft Heinz is the third-largest food and beverage company in North America and the fifth-largest in the world with over $26.0 billion in annual sales as of 2021. In addition to Kraft and Heinz, over 20 other brands are part of the company's profile including Boca Burger, Gevalia, Grey Poupon, Oscar Mayer, Philadelphia Cream Cheese, Primal Kitchen, and Wattie's, eight of which have total individual sales of over $1 billion. Kraft Heinz ranked 114th in the 2018 Fortune 500 list of the largest United States corporations based on 2017 total revenue."},
{"name": ["Vertex Pharmaceuticals Incorporated"], "stock_Value": ["$352.43"], "time": ["Nov 24, 9:48:47 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$353.23"], "day_range": ["$352.14 - $355.41"], "volume": ["$282.21 - $387.42"], "market_segment": ["1.46M"], "info": "Vertex Pharmaceuticals is an American biopharmaceutical company based in Boston, Massachusetts. It was one of the first biotech firms to use an explicit strategy of rational drug design rather than combinatorial chemistry. It maintains headquarters in South Boston, Massachusetts, and three research facilities, in San Diego, California, and Milton Park, Oxfordshire, England."},
{"name": ["Stratasys Ltd"], "stock_Value": ["$11.13"], "time": ["Nov 24, 9:48:52 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$11.00"], "day_range": ["$11.00 - $11.16"], "volume": ["$9.95 - $21.72"], "market_segment": ["646.48K"], "info": "Stratasys, Ltd. is an American-Israeli manufacturer of 3D printers, software, and materials for polymer additive manufacturing as well as 3D-printed parts on-demand. The company is incorporated in Israel. Engineers use Stratasys systems to model complex geometries in a wide range of polymer materials, including: ABS, polyphenylsulfone, polycarbonate and polyetherimide and Nylon 12. Stratasys manufactures in-office prototyping and direct digital manufacturing systems for automotive, aerospace, industrial, recreational, electronic, medical and consumer product OEMs."},
{"name": ["GameStop Corp"], "stock_Value": ["€11.15"], "time": ["Nov 24, 2:15:16 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€11.05"], "day_range": ["€11.04 - €11.15"], "volume": ["€11.01 - €26.41"], "market_segment": ["-"], "info": "GameStop Corp. is an American video game, consumer electronics, and gaming merchandise retailer. The company is headquartered in Grapevine, Texas, and is the largest video game retailer worldwide. As of 28 January 2023, the company operates 4,413 stores including 2,949 in the United States, 216 in Canada, 419 in Australia and 829 in Europe under the GameStop, EB Games, EB Games Australia, Micromania-Zing, ThinkGeek and Zing Pop Culture brands. The company was founded in Dallas in 1984 as Babbage's, and took on its current name in 1999. The company's performance declined during the mid-to-late 2010s due to the shift of video game sales to online shopping and failed investments by GameStop in smartphone retail. In 2021, after retail investors noticed that the short interest well exceeded the float, the company's stock price skyrocketed. According to the SEC report, this volatility was only in part due to the shorts covering their positions, but mostly thanks to the massive buying power of retail investors. The company received significant media attention during January and February 2021 due to the volatility of its stock price in the GameStop short squeeze."},
{"name": ["Andes Technology Corp"], "stock_Value": ["$489.00"], "time": ["Nov 24, 2:42:31 PM GMT+8 · TWD · TPE ·"], "previous_close": ["$503.00"], "day_range": ["$485.00 - $511.00"], "volume": ["$376.50 - $613.00"], "market_segment": ["-"], "info": "Andes Technology Corporation is a Taiwanese supplier of 32/64-bit embedded CPU cores and a founding Premier member of RISC-V International. It focuses on the embedded market and delivers CPU cores with integrated development environment and associated software and hardware for SoC development. Andes is ranked the fifth IP company in the world. By the end of 2022, the cumulative volume of Andes-Embedded SoCs has surpassed 12 billion."},
{"name": ["Deutsche Lufthansa AG"], "stock_Value": ["€7.83"], "time": ["Nov 24, 2:20:36 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€7.86"], "day_range": ["€7.80 - €7.83"], "volume": ["€6.54 - €11.11"], "market_segment": ["4.89"], "info": "Deutsche Lufthansa AG, commonly shortened to Lufthansa, serves as the flag carrier of Germany. When combined with its subsidiaries, it stands as the second-largest airline in Europe in terms of passengers carried, after the ultra low-cost carrier Ryanair. Lufthansa is also one of the five founding members of Star Alliance, which is the world's largest airline alliance, formed in 1997. Besides its own services, and owning subsidiary passenger airlines Austrian Airlines, Swiss International Air Lines, Brussels Airlines, and Eurowings, Deutsche Lufthansa AG owns several aviation-related companies, such as Lufthansa Technik and LSG Sky Chefs, as part of the Lufthansa Group. In total, the group has over 700 aircraft, making it one of the largest airline fleets in the world. Lufthansa's registered office and corporate headquarters are in Cologne. The main operations base, called Lufthansa Aviation Center, is at Lufthansa's primary hub at Frankfurt Airport, and its secondary hub is at Munich Airport where a secondary Flight Operations Centre is maintained."},
{"name": ["AIA Group Ltd"], "stock_Value": ["$71.40"], "time": ["Nov 24, 4:08:38 PM GMT+8 · HKD · HKG ·"], "previous_close": ["$73.45"], "day_range": ["$71.30 - $72.75"], "volume": ["$61.15 - $93.65"], "market_segment": ["20.54M"], "info": "AIA Group Limited, often known as AIA, is a Hong Kong-based multinational insurance and finance corporation. It is the largest publicly listed life insurance group in Asia-Pacific. It offers insurance and financial services, writing life insurance for individuals and businesses, as well as accident and health insurance, and offers retirement planning, and wealth management services, variable contracts, investments and securities. AIA is headquartered in Central, Hong Kong, with a presence in 18 markets in Asia-Pacific, with wholly-owned branches and subsidiaries in Hong Kong, mainland China, Taiwan, Macau, South Korea, Singapore, Thailand, Malaysia, the Philippines, Indonesia, Vietnam, Brunei, Cambodia, Myanmar, Australia, New Zealand, Sri Lanka and a 49% joint venture in India. Since 2013, AIA has had an exclusive bancassurance agreement with Citibank that encompasses 11 AIA markets in Asia-Pacific. In August 2013, AIA became the official shirt partner of the English Premier League football club Tottenham Hotspur."},
{"name": ["RELIEF THERAPEUTICS Holding SA"], "stock_Value": ["CHF 1.87"], "time": ["Nov 24, 3:09:30 PM GMT+1 · CHF · SWX ·"], "previous_close": ["CHF 1.87"], "day_range": ["CHF 1.87 - CHF 1.97"], "volume": ["CHF 1.50 - CHF 15.00"], "market_segment": ["12.87K"], "info": "Relief Therapeutics is a Swiss biopharmaceutical company based in Geneva. The company focuses on developing drugs for serious diseases with few or no existing treatment options. Its lead compound, RLF-100, is a synthetic form of a natural peptide that protects the lung. The company was incorporated as Relief Therapeutics Holdings AG and listed on the SIX Swiss Exchange in 2016."},
{"name": ["TAV Havalimanlari Holding AS"], "stock_Value": ["₺118.80"], "time": ["Nov 24, 5:34:02 PM GMT+3 · TRY · IST ·"], "previous_close": ["₺119.60"], "day_range": ["₺116.90 - ₺120.10"], "volume": ["₺63.70 - ₺139.20"], "market_segment": ["4.14M"], "info": "TAV Airports Holding is a Turkish airport operation and services firm that is part of Groupe ADP. It is one of the world's largest airport operators, providing services to 1 million flights and 152 million passengers in 2018. TAV was established as a joint venture between Tepe Construction, Akfen, and Airport Consulting Vienna in 1997. Today, it is the leading airport operator in Turkey and also provides duty free, food and beverage, ground handling, IT and security services."},
{"name": ["Helios and Matheson Analytics Inc"], "stock_Value": ["$0.00"], "time": ["Nov 22, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$0.00"], "day_range": ["$0.00 - $0.00"], "volume": ["3.00K USD"], "market_segment": ["-"], "info": "Helios and Matheson Analytics was a publicly traded data analytics company based in New York City, New York. The company became widely known during its final years for acquiring and subsequently operating MoviePass, which ultimately led to the company's bankruptcy."},
{"name": ["Inpex Corp"], "stock_Value": ["¥2,111.50"], "time": ["Nov 24, 5:45:11 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥2,108.00"], "day_range": ["¥2,103.50 - ¥2,124.00"], "volume": ["¥1,301.00 - ¥2,368.50"], "market_segment": ["6.14"], "info": "INPEX Corporation is a Japanese oil company established in February 1966 as North Sumatra Offshore Petroleum Exploration Co., Ltd. INPEX is the largest oil and gas exploration and production company in Japan, with global exploration, development and production projects in 20 countries. In the 2020 Forbes Global 2000, INPEX was ranked as the 597th -largest public company in the world."},
{"name": ["Vera Bradley, Inc."], "stock_Value": ["$7.62"], "time": ["Nov 24, 9:48:31 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$7.64"], "day_range": ["$7.62 - $7.68"], "volume": ["$3.51 - $8.35"], "market_segment": ["213.34K"], "info": "Vera Bradley Sales, LLC is an American luggage and handbag design company, founded by Barbara Bradley Baekgaard and Patricia R. Miller in 1982. As of 2019, its home office is in Fort Wayne, Indiana. The company was named after Baekgaard's mother. Its original luxury cotton bag product lines have expanded to include fashion and home accessories, office supplies, and patterned gifts. Many items have distinctive florals, paisleys, or geometric prints with complementary linings, as well as elongated diamond quilting. The patterns were originally inspired by French Provençal country fabrics and have limited seasonal releases each year. In September 2022, the company named Jacqueline Ardrey as their new CEO."},
{"name": ["Industri Jamu dn Frms Sd Mncl Tbk PT"], "stock_Value": ["Rp 498.00"], "time": ["Nov 24, 4:40:00 PM GMT+7 · IDR · IDX ·"], "previous_close": ["Rp 498.00"], "day_range": ["Rp 498.00 - Rp 500.00"], "volume": ["Rp 478.00 - Rp 915.00"], "market_segment": ["24.83M"], "info": "PT Industri Jamu dan Farmasi Sido Muncul Tbk, commonly known as Sido Muncul, is an Indonesian herbal medicine and food products company based in Semarang, Indonesia, established in 1940. It produces and markets a variety of consumer products related to herbal medication, such as the jamu Tolak Angin."},
{"name": ["China Tower Corp Ltd"], "stock_Value": ["$0.81"], "time": ["Nov 24, 4:08:38 PM GMT+8 · HKD · HKG ·"], "previous_close": ["$0.82"], "day_range": ["$0.80 - $0.83"], "volume": ["$0.71 - $1.02"], "market_segment": ["126.27M"], "info": "China Tower Corporation Limited, China Tower in short form, is a state-owned telecommunication company in providing telecommunication tower construction, tower maintenance, ancillary facilities management, and other services through Mainland China. China Tower was established in July 2014 by merging the telecom tower businesses among China's three telecom giants - China Mobile, China Unicom and China Telecom, which are customers and shareholders of China Tower. It was listed on Hong Kong Stock Exchange on 8 August 2018 at a price of HK$1.26 per share which raised US$6.9 billion."},
{"name": ["NBCC (India) Ltd"], "stock_Value": ["₹64.25"], "time": ["Nov 24, 3:59:59 PM GMT+5:30 · INR · NSE ·"], "previous_close": ["₹65.10"], "day_range": ["₹64.05 - ₹65.55"], "volume": ["₹30.95 - ₹74.35"], "market_segment": ["34.91"], "info": "NBCC (India) Limited, formerly known as National Buildings Construction Corporation is a central public sector enterprise under the Indian Ministry of Housing and Urban Affairs. The central public sector undertakings' present areas of operations are categorised into three main segments, i.e. Project Management Consultancy, including redevelopment of government properties, Engineering, Procurement & Construction and Real Estate Development. NBCC acquired 100 per cent stake in Mini Ratna hospital consultancy firm Hospital Services Consultancy Corporation Limited from Ministry of Health and Family Welfare on 6 November 2018. The organization acquired over 51% stake in Hindustan Steelworks Construction Limited, a PSU under the Steel Ministry in 2017. NBCC is headquartered in the city of New Delhi, India and it has 31 regional offices across India. The projects undertaken by the company are located across India and in countries such as Iraq, Libya, Nepal, Mauritius, Turkey, Botswana, Maldives, Yemen, Oman, UAE, Dubai and Africa."},
{"name": ["ArcelorMittal SA"], "stock_Value": ["$24.46"], "time": ["Nov 24, 9:47:35 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$24.23"], "day_range": ["$24.34 - $24.46"], "volume": ["$21.30 - $32.49"], "market_segment": ["2.46M"], "info": "ArcelorMittal S.A. is a Luxembourg-based multinational steel manufacturing corporation headquartered in Luxembourg City. It was formed in 2006 from the takeover and merger of Arcelor by Indian-owned Mittal Steel. ArcelorMittal is the second largest steel producer in the world, with an annual crude steel production of 88 million metric tonnes as of 2022. It is ranked 197th in the 2022 Fortune Global 500 ranking of the world's largest corporations. It directly and indirectly employs around 200,000 people and its market capital is $25 billion. The total value of company assets is estimated to be around $100 billion."},
{"name": ["Vestas Wind Systems A/S"], "stock_Value": ["kr 171.24"], "time": ["Nov 24, 3:48:02 PM GMT+1 · DKK · CPH ·"], "previous_close": ["kr 173.32"], "day_range": ["kr 170.90 - kr 173.96"], "volume": ["kr 133.08 - kr 217.45"], "market_segment": ["2.39M"], "info": "Vestas Wind Systems A/S is a Danish manufacturer, seller, installer, and servicer of wind turbines that was founded in 1945. The company operates manufacturing plants in Denmark, Germany, the Netherlands, Taiwan, India, Italy, Romania, the United Kingdom, Spain, Sweden, Norway, Australia, China, Brazil, Poland and the United States, and employs 29,000 people globally. As of 2013, it is the largest wind turbine company in the world."},
{"name": ["Chugai Pharmaceutical Co Ltd"], "stock_Value": ["¥5,073.00"], "time": ["Nov 24, 5:45:13 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥4,940.00"], "day_range": ["¥5,000.00 - ¥5,105.00"], "volume": ["¥3,191.00 - ¥5,105.00"], "market_segment": ["24.80"], "info": "Chugai Pharmaceutical Co., Ltd. is a drug manufacturer operating in Japan. It is a subsidiary controlled by Hoffmann-La Roche, which owns 62% of the company as of 30 June 2014. The company is headquartered in Tokyo. Osamu Nagayama is the current representative director and chairman. Tatsuro Kosaka is the current representative director, president and CEO."},
{"name": ["Telefonica SA"], "stock_Value": ["€3.82"], "time": ["Nov 24, 3:34:03 PM GMT+1 · EUR · BME ·"], "previous_close": ["€3.84"], "day_range": ["€3.81 - €3.84"], "volume": ["€3.22 - €4.15"], "market_segment": ["10.78M"], "info": "Telefónica, S.A. is a Spanish multinational telecommunications company headquartered in Madrid, Spain. It is one of the largest telephone operators and mobile network providers in the world. It provides fixed and mobile telephony, broadband, and subscription television, operating in Europe and the Americas. As well as the Telefónica brand, it also trades as Movistar, O2, and Vivo. The company is a component of the Euro Stoxx 50 stock market index."},
{"name": ["CureVac BV"], "stock_Value": ["€5.06"], "time": ["Nov 24, 3:04:24 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€5.08"], "day_range": ["€5.04 - €5.06"], "volume": ["€4.67 - €12.98"], "market_segment": ["-"], "info": "CureVac N.V. is a German biopharmaceutical company. It develops therapies based on messenger RNA. Headquartered in Tübingen, Germany, the company was founded in 2000 by Ingmar Hoerr, Steve Pascolo, Florian von der Mulbe, Günther Jung, and Hans-Georg Rammensee. CureVac has approximately 375 employees since May 2018. At the beginning of the COVID-19 pandemic, CureVac was an early starter in the race to develop a German vaccine for protection against COVID-19, caused by infection with the SARS-CoV-2 virus. Clinical trials for the CureVac COVID-19 Vaccine began in June 2020, and in the same month, the German Federal Government invested €300 million in CureVac, with one of the terms of the agreement being that KfW will hold a stake of approximately 23% in the company. In June 2021 the company announced that CVnCoV displayed inadequate results in Phase III clinical trials with only 47% efficacy. In October 2021 the company announced it would be abandon further research and development into CVnCoV and would instead focus its efforts in collaborating with GSK to develop improved mRNA vaccine technology."},
{"name": ["IHI Corp"], "stock_Value": ["¥3,000.00"], "time": ["Nov 24, 5:45:15 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥2,881.50"], "day_range": ["¥2,909.00 - ¥3,005.00"], "volume": ["¥2,666.00 - ¥4,130.00"], "market_segment": ["-"], "info": "IHI Corporation, formerly known as Ishikawajima-Harima Heavy Industries Co., Ltd. is a Japanese engineering corporation headquartered in Tokyo, Japan that produces and offers ships, space launch vehicles, aircraft engines, marine diesel engines, gas turbines, gas engines, railway systems, turbochargers for automobiles, plant engineering, industrial machinery, power station boilers and other facilities, suspension bridges and other structures. IHI is listed on the Tokyo Stock Exchange Section 1."},
{"name": ["Great Wall Motor Company Ltd Ord Shs H"], "stock_Value": ["$12.00"], "time": ["Nov 24, 4:08:38 PM GMT+8 · HKD · HKG ·"], "previous_close": ["$11.98"], "day_range": ["$11.80 - $12.08"], "volume": ["$7.77 - $12.66"], "market_segment": ["39.91M"], "info": "Great Wall Motor Co., Ltd. is a Chinese privately owned automobile manufacturer headquartered in Baoding, Hebei. Founded in 1984, it is currently the eighth largest automobile manufacturer in China, with 1.281 million sales in 2021. The company produces and sells vehicles under its own branding, such as GWM, Haval, WEY, TANK, POER, ORA. It also produces electric vehicles under some of the previously listed brandings, including dedicated EV brands such as ORA. Named after the Great Wall of China, the company is China's largest producer of sport-utility vehicles and pick-up trucks. In 2021, it was the third largest Chinese plug-in electric vehicle manufacturer in the Chinese market, with 4% of market share, selling under brand names such as Ora and Haval."},
{"name": ["Check Point Software Technologies Ltd."], "stock_Value": ["$144.92"], "time": ["Nov 24, 9:48:45 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$143.43"], "day_range": ["$144.04 - $145.42"], "volume": ["$117.18 - $145.42"], "market_segment": ["912.81K"], "info": "Check Point is an American-Israeli multinational provider of software and combined hardware and software products for IT security, including network security, endpoint security, cloud security, mobile security, data security and security management. As of 2021, the company has approximately 6,000 employees worldwide. Headquartered in Tel Aviv, Israel and San Carlos, California, the company has development centers in Israel and Belarus and previously held in the United States, Sweden following acquisitions of companies who owned these centers. The company has offices in over 70 locations worldwide including main offices in North America, 10 in the United States, 4 in Canada as well as in Europe and in Asia Pacific."},
{"name": ["Assertio Holdings Inc"], "stock_Value": ["$1.22"], "time": ["Nov 24, 9:49:03 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$1.24"], "day_range": ["$1.22 - $1.25"], "volume": ["$0.87 - $8.01"], "market_segment": ["1.80M"], "info": "Assertio Therapeutics, Inc. is an American specialty pharmaceutical company. It mainly markets products for treatment in neurology, pain and diseases of the central nervous system. Depomed was founded in 1995 and is headquartered in Newark, California. It is a publicly traded company on NASDAQ, with several products approved by the United States Food and Drug Administration. On August 15, 2018, the company announced its name change from Depomed, Inc., to Assertio Therapeutics, Inc. As of 2019, Assertio markets three products approved by the FDA: Gralise, Cambia, and Zipsor."},
{"name": ["Jiangxi Copper Ord Shs A"], "stock_Value": ["¥17.85"], "time": ["Nov 24, 4:00:03 PM GMT+8 · CNY · SHA ·"], "previous_close": ["¥17.91"], "day_range": ["¥17.79 - ¥17.94"], "volume": ["¥16.55 - ¥21.77"], "market_segment": ["9.27M"], "info": "Jiangxi Copper is the largest copper producer in Mainland China. Its operations include copper mining, milling, smelting and refining to produce copper-related products, including pyrite concentrates, sulfuric acid and electrolytic gold and silver. Its chairman is Mr.Zheng Gaoqing and its headquarters is at Nanchang, Jiangxi, China. The company manufactures 340,000 tons of copper annually from its mines, which include the Dexing and Yongping pits and the Wushan, Jiangxi, underground mine. Jiangxi Copper is also engaged in the production, processing and sale of copper cathodes, copper rods and wires and other related products. The company also provides precious metals such as gold and silver; chemical products such as sulfuric acid and sulfur ore concentrate; as well as rare metals and minerals such as molybdenum, selenium, rhenium, tellurium and bismuth. Jiangxi Copper is also involved in the exploration and exploitation of copper, gold, silver, lead and zinc, as well as the provision of financial services. Jiangxi Copper distributes its products in domestic markets, and exports to Hong Kong, Taiwan, Australia and Thailand, among others."},
{"name": ["YOSHINOYA HOLDINGS CO LTD"], "stock_Value": ["¥3,378.00"], "time": ["Nov 24, 5:45:17 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥3,385.00"], "day_range": ["¥3,346.00 - ¥3,391.00"], "volume": ["¥2,238.00 - ¥3,585.00"], "market_segment": ["40.33"], "info": "Yoshinoya is a Japanese multinational fast food chain, and the second-largest chain of gyūdon restaurants. The chain was established in Japan in 1899. Its motto is \"Tasty, low-priced, and quick\"."},
{"name": ["Banco Santander SA"], "stock_Value": ["$4.07"], "time": ["Nov 24, 9:40:09 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$4.03"], "day_range": ["$4.07 - $4.09"], "volume": ["$2.82 - $4.09"], "market_segment": ["2.96M"], "info": "Banco Santander, S.A., doing business as Santander Group, is a Spanish multinational financial services company based in Madrid and Santander in Spain. Additionally, Santander maintains a presence in all global financial centres as the 19th-largest banking institution in the world. Although known for its European banking operations, it has extended operations across North and South America, and more recently in continental Asia. It is considered a systemically important bank by the Financial Stability Board. Many subsidiaries, such as Abbey National, have been rebranded under the Santander name. The company is a component of the Euro Stoxx 50 stock market index. In June 2023, Santander was ranked as 49th in the Forbes Global 2000 list of the world's biggest public companies. Santander is Spain's largest bank. Banco Santander is chaired by Ana Patricia Botín-Sanz de Sautuola O'Shea, daughter and granddaughter of former chairmen Emilio Botin-Sanz de Sautuola y García de los Ríos and Emilio Botín-Sanz de Sautuola López, respectively."},
{"name": ["Ganfeng Lithium Group Co Ltd"], "stock_Value": ["¥41.84"], "time": ["Nov 24, 4:29:45 PM GMT+8 · CNY · SHE ·"], "previous_close": ["¥42.33"], "day_range": ["¥41.80 - ¥42.33"], "volume": ["¥41.45 - ¥83.52"], "market_segment": ["29.52M"], "info": "Ganfeng Lithium Co., Ltd. is a company that produces lithium, lithium products, other metals, and batteries in mainland China and globally. It was founded by Li Liangbin in 2000 and is headquartered in Xinyu, Jiangxi. It is the largest lithium salt producer in China and the third largest in the world, as well as the second largest lithium processor in the world. It is traded on both the Shenzhen Stock Exchange and the Hong Kong Stock Exchange and has a market capitalization of US$26 billion."},
{"name": ["Shin-Etsu Chemical Co Ltd"], "stock_Value": ["¥5,224.00"], "time": ["Nov 24, 5:45:13 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥5,191.00"], "day_range": ["¥5,212.00 - ¥5,289.00"], "volume": ["¥3,158.00 - ¥5,289.00"], "market_segment": ["17.09"], "info": "Shin-Etsu Chemical Co., Ltd. is the largest chemical company in Japan, ranked No. 9 in Forbes Global 2000 for chemical sector. Shin-Etsu has the largest global market share for polyvinyl chloride, semiconductor silicon, and photomask substrates. The company was named one of Thomson Reuters Top 100 Global Innovators in 2011, 2012, 2013 and 2014. “Shin-Etsu” in the company's name derives from Shin'etsu Region, where the company established the first chemical plant as Shin-Etsu Nitrogen Fertilizer in 1926, though the company today is headquartered in Tokyo and has its manufacturing locations in 14 countries worldwide."},
{"name": ["Myriad Genetics, Inc."], "stock_Value": ["$17.72"], "time": ["Nov 24, 9:49:12 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$17.70"], "day_range": ["$17.52 - $17.79"], "volume": ["$13.82 - $24.21"], "market_segment": ["684.38K"], "info": "Myriad Genetics, Inc. is an American genetic testing and precision medicine company based in Salt Lake City, Utah, United States. Myriad employs a number of proprietary technologies that permit doctors and patients to understand the genetic basis of human disease and the role that genes play in the onset, progression and treatment of disease. This information is used to guide the development of new products that assess an individual's risk for developing disease later in life, identify a patient's likelihood of responding to a particular drug therapy, assess a patient's risk of disease progression and disease recurrence, and measure disease activity."},
{"name": ["Godrej Properties Ltd"], "stock_Value": ["₹1,838.00"], "time": ["Nov 24, 3:59:09 PM GMT+5:30 · INR · NSE ·"], "previous_close": ["₹1,852.35"], "day_range": ["₹1,832.20 - ₹1,864.45"], "volume": ["₹1,005.00 - ₹1,914.55"], "market_segment": ["76.88"], "info": "Godrej Properties Limited is a real estate company with its head office in Mumbai, India. A subsidiary of Godrej Industries Ltd, the company was established in 1990 under the leadership of Adi Godrej. The company is currently developing projects that are estimated to cover more than 89.7 million square feet. Currently, Godrej Properties Limited is listed on the Bombay Stock Exchange and the National Stock Exchange. It operates in Chandigarh, Gurgaon, Ahmedabad, Kolkata, Nagpur, Mumbai, Pune, Hyderabad, Mangalore, Noida, Bengaluru, Chennai and Kochi."},
{"name": ["Urban One Inc Class D"], "stock_Value": ["$4.27"], "time": ["Nov 24, 9:46:54 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$4.13"], "day_range": ["$4.27 - $4.27"], "volume": ["$3.39 - $6.34"], "market_segment": ["32.76K"], "info": "Urban One, Inc. is a Silver Spring, Maryland-based American media conglomerate. Founded in 1980 by Cathy Hughes, the company primarily operates media properties targeting African Americans. It is the largest African-American-owned broadcasting company in the United States, operating 55 radio stations and majority-owning the syndicator Reach Media, as well as its digital arm Interactive One, and the cable network TV One. As of 2014, it was the ninth-highest-earning African-American-owned business in the United States."},
{"name": ["American Tower Corp"], "stock_Value": ["$197.63"], "time": ["Nov 24, 9:49:01 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$198.79"], "day_range": ["$196.40 - $198.31"], "volume": ["$154.58 - $235.57"], "market_segment": ["2.36M"], "info": "American Tower Corporation is an American real estate investment trust which owns and operates wireless and broadcast communications infrastructure in several countries. It is headquartered in Boston, Massachusetts, US. It is ranked 375th on the Fortune 500 in 2022. As of December 31, 2021, the company owned 199,330 communications sites, including 27,494 sites in the U.S. and Canada, 74,813 sites in Asia, 29,722 sites in Europe, 21,455 in Africa, and 45,816 sites in Latin America."},
{"name": ["Waste Management, Inc."], "stock_Value": ["$171.54"], "time": ["Nov 24, 9:49:18 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$171.78"], "day_range": ["$171.12 - $172.82"], "volume": ["$148.31 - $173.71"], "market_segment": ["1.66M"], "info": "Waste Management, Inc., doing business as “WM”, is a waste management, comprehensive waste, and environmental services company operating in North America. Founded in 1968, the company is headquartered in the Bank of America Tower in Houston, Texas. The company's network includes 346 transfer stations, 293 active landfill disposal sites, 146 recycling plants, 111 beneficial-use landfill gas projects and six independent power production plants. Waste Management provide environmental services to nearly 21 million residential, industrial, municipal and commercial customers in the United States, Canada, and Puerto Rico. With 26,000 collection and transfer vehicles, the company has the largest trucking fleet in the waste industry. Combined with its largest competitor Republic Services, Inc, the two handle more than half of all garbage collection in the United States."},
{"name": ["Kingstone Companies Inc"], "stock_Value": ["$3.00"], "time": ["Nov 24, 9:32:06 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$3.00"], "day_range": ["$2.89 - $3.15"], "volume": ["$0.86 - $3.39"], "market_segment": ["18.66K"], "info": "Kingstone Companies, Inc., headquartered in Kingston, New York, provides property and casualty insurance products through its subsidiary, Kingstone Insurance Company. It places contracts with the third-party licensed premium finance company through its subsidiary Payments, Inc, a NYS licensed Insurance Premium Finance Company. Kingstone Insurance Company was ranked #1 of the 81 insurers rated by the Professional Insurance Agents Association in its 2010 Company Performance Survey. The company sells insurance products include personal lines of insurance products, general liability policies commercial automobile policies and so on through independent retail and wholesale agents and brokers."},
{"name": ["Cintas Corporation"], "stock_Value": ["$551.45"], "time": ["Nov 24, 9:49:27 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$554.82"], "day_range": ["$547.52 - $552.26"], "volume": ["$423.06 - $559.01"], "market_segment": ["350.32K"], "info": "Cintas Corporation is an American corporation headquartered in Mason, Ohio which provides a range of products and services to businesses including uniforms, mats, mops, cleaning and restroom supplies, first aid and safety products, fire extinguishers and testing, and safety courses. Cintas is a publicly held company traded on the Nasdaq Global Select Market under the symbol CTAS and is a component of the Standard & Poor's 500 Index. The company is one of the largest in the industry with 44,500 employees in 2023. In 2020, the company reported $7.09 billion in total revenue."},
{"name": ["Peabody Energy Corp"], "stock_Value": ["$23.86"], "time": ["Nov 24, 9:49:03 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$23.59"], "day_range": ["$23.50 - $23.90"], "volume": ["$17.71 - $32.89"], "market_segment": ["2.70M"], "info": "Peabody Energy is a coal mining company headquartered in St. Louis, Missouri. Its primary business consists of the mining, sale, and distribution of coal, which is purchased for use in electricity generation and steelmaking. Peabody also markets, brokers, and trades coal through offices in China, Australia, and the United States. In 2022, Peabody recorded sales of 124 million tons of coal. Peabody markets coal to electricity generating and industrial customers in more than 26 nations. As of December 31, 2022, the company had approximately 2.4 billion tons of proven and probable coal reserves. Peabody maintains ownership or majority interests in 17 surface and underground mining operations located throughout the United States and Australia. In the United States, company-owned mines are located in Alabama, Colorado, Illinois, Indiana, New Mexico, and Wyoming. Peabody's largest operation is the North Antelope Rochelle Mine located in Campbell County, Wyoming, which mined more than 60 million tons of coal in 2022. Peabody spun off coal mining operations in West Virginia and Kentucky into Patriot Coal Corporation in October 2007."},
{"name": ["Guangzhou Automobile Group Co Ltd"], "stock_Value": ["$3.69"], "time": ["Nov 24, 4:08:38 PM GMT+8 · HKD · HKG ·"], "previous_close": ["$3.73"], "day_range": ["$3.66 - $3.74"], "volume": ["$3.57 - $5.98"], "market_segment": ["11.48M"], "info": "Guangzhou Automobile Group Co., Ltd. is a Chinese state-owned automobile manufacturer headquartered in Guangzhou, Guangdong. Founded in 1954, it is currently the fifth largest automobile manufacturer in China, with 2.144 million sales in 2021. The company produces and sells vehicles under its own branding, such as Trumpchi, Aion, Hycan as well as under foreign-branded joint ventures such as GAC-Toyota, GAC-Honda, and GAC-Mitsubishi. It also produces electric vehicles under some of the previously listed brandings, including dedicated EV brands such as Aion and Hycan. It produces buses under the GAC Bus brand. Other brand names associated with GAC are Everus, for consumer vehicles, and Hino. In 2021, it was the fourth largest Chinese plug-in electric vehicle manufacturer in the Chinese market, with 4% of market share. It sold 123,660 units of EVs in 2021, and over 20,000 units in March 2022, with plans to double EV production capacity to 400,000 a year by December 2022."},
{"name": ["Lightinthebox Holding Co Ltd"], "stock_Value": ["$1.30"], "time": ["Nov 24, 9:46:58 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$1.30"], "day_range": ["$1.30 - $1.33"], "volume": ["$0.97 - $1.88"], "market_segment": ["56.20K"], "info": "LightInTheBox Holding Co., Ltd. is an apparel e-commerce retailer that ships worldwide. LightInTheBox operates its business through mobile applications and multiple websites. The company is headquartered in Singapore and has additional offices in California, Shanghai, and Beijing."},
{"name": ["Senior plc"], "stock_Value": ["GBX 171.40"], "time": ["Nov 24, 2:36:50 PM UTC · GBX · LON ·"], "previous_close": ["GBX 171.00"], "day_range": ["GBX 170.86 - GBX 175.40"], "volume": ["GBX 115.40 - GBX 184.00"], "market_segment": ["358.63K"], "info": "Senior plc is the holding company for a global group of firms in the manufacturing and engineering industries, headquartered in Rickmansworth, England. The Company is listed on the London Stock Exchange and is a constituent of the FTSE 250 Index."},
{"name": ["SoftBank Group Corp - ADR"], "stock_Value": ["$20.78"], "time": ["Nov 24, 9:30:20 AM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$21.00"], "day_range": ["$20.71 - $20.94"], "volume": ["$17.95 - $26.05"], "market_segment": ["208.19K"], "info": "SoftBank Group Corp. is a Japanese multinational investment holding company headquartered in Minato, Tokyo which focuses on investment management. The group primarily invests in companies operating in technology that offer goods and services to customers in a multitude of markets and industries ranging from the internet to automation. With over $100 billion in capital at its onset, SoftBank's Vision Fund is the world's largest technology-focused venture capital fund. Fund investors included sovereign wealth funds from countries in the Middle East. The company is known for the leadership of its controversial founder and largest shareholder Masayoshi Son. Its investee companies, subsidiaries and divisions, including several unprofitable unicorns, operate in robotics, artificial intelligence, software, logistics, transportation, biotechnology, robotic process automation, proptech, real estate, hospitality, broadband, fixed-line telecommunications, e-commerce, information technology, finance, media and marketing, and other areas. Among its most internationally recognizable current stockholdings are stakes in Arm, Alibaba, OYO Rooms, WeWork and Deutsche Telekom."},
{"name": ["Bangkok Airways PCL"], "stock_Value": ["฿14.80"], "time": ["Nov 24, 5:12:00 PM GMT+7 · THB · BKK ·"], "previous_close": ["฿15.20"], "day_range": ["฿14.60 - ฿14.90"], "volume": ["฿11.80 - ฿17.60"], "market_segment": ["5.29M"], "info": "Bangkok Airways Public Company Limited is a regional airline based in Bangkok, Thailand. It operates scheduled services to destinations in Thailand, Cambodia, Hong Kong, Laos, Maldives, Myanmar, Singapore, and Vietnam. Its main base is Suvarnabhumi Airport."},
{"name": ["Bumi Resources Tbk PT"], "stock_Value": ["Rp 107.00"], "time": ["Nov 24, 4:40:00 PM GMT+7 · IDR · IDX ·"], "previous_close": ["Rp 109.00"], "day_range": ["Rp 105.00 - Rp 110.00"], "volume": ["Rp 90.00 - Rp 198.00"], "market_segment": ["2.93"], "info": "PT Bumi Resources Tbk is one of the largest mining companies in Indonesia structured as a holding company. In the 2012 Forbes Global 2000, Bumi Resources was ranked as the 1898th-largest public company in the world. It is reputedly the biggest thermal coal producer in Indonesia and is majority owned by the Bakrie Group."},
{"name": ["J.Front Retailing Co Ltd"], "stock_Value": ["¥1,382.50"], "time": ["Nov 24, 5:45:12 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥1,400.00"], "day_range": ["¥1,381.50 - ¥1,413.00"], "volume": ["¥1,081.00 - ¥1,634.50"], "market_segment": ["21.37"], "info": "J. Front Retailing Co., Ltd. is a major holding company in Japan, headquartered in Yaesu, Chūō, Tokyo. It was established with a capitalization of 30 billion yen on September 3, 2007. It holds 100% of the stock in Daimaru Matsuzakaya Department Stores, which operates the department-store chains Daimaru and Matsuzakaya. It is traded on the Tokyo, Osaka, and Nagoya Stock Exchanges. J. Front's registered headquarters are in the Matsuzakaya Ginza store."},
{"name": ["Kura Sushi Inc"], "stock_Value": ["¥3,740.00"], "time": ["Nov 24, 5:45:12 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥3,665.00"], "day_range": ["¥3,680.00 - ¥3,770.00"], "volume": ["¥2,913.00 - ¥3,770.00"], "market_segment": ["-"], "info": "Kura Sushi is a Japanese sushi restaurant chain. It is the second largest sushi restaurant chain in Japan, behind Sushiro and ahead of Hama Sushi. Its headquarters are in Sakai, Osaka Prefecture. It has 451 locations in Japan, 22 in Taiwan, and 47 in the United States. While it is a conveyor belt sushi chain, it relies on a high level of automation allowing the average location to function with fifteen to twenty staff members. At Kura Sushi's locations, each of them own a robot known as \"KuraB the Kurabot\", who delivers things such as food and beverages, however sometimes employees will simply supply the beverages themselves."},
{"name": ["Yield10 Bioscience Inc"], "stock_Value": ["$0.22"], "time": ["Nov 24, 9:36:55 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$0.22"], "day_range": ["$0.22 - $0.22"], "volume": ["$0.21 - $4.19"], "market_segment": ["205.41K"], "info": "Yield10 Bioscience is a company developing new technologies to achieve improvements in crop yield to enhance global food security."},
{"name": ["Amplify Energy Corp"], "stock_Value": ["$6.29"], "time": ["Nov 24, 9:49:03 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$6.23"], "day_range": ["$6.19 - $6.30"], "volume": ["$5.84 - $10.23"], "market_segment": ["416.61K"], "info": "Amplify Energy Corp is an oil company based in Houston, Texas. It trades as NYSE: AMPY and has 230 employees."},
{"name": ["Samsung Heavy Industries Co Ltd"], "stock_Value": ["₩7,630.00"], "time": ["Nov 24, 6:26:10 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩7,890.00"], "day_range": ["₩7,610.00 - ₩7,890.00"], "volume": ["₩4,790.00 - ₩9,470.00"], "market_segment": ["3.92M"], "info": "Samsung Heavy Industries Co., Ltd. is one of the largest shipbuilders in the world and one of the \"Big Three\" shipbuilders of South Korea. Geoje is one of the largest shipyards in the world, having 3 dry docks and 5 floating docks. A core subsidiary of the Samsung Group, South Korea's largest conglomerate, SHI's main focus is on the engineering, procurement, construction, commissioning and the delivery of: transportation ships for the commercial industry, topsides modules, drilling and floating production units for the oil and gas sector, gantry cranes for fabrication yards, digital instrumentation and control devices for ships, and other construction and engineering services. SHI operates manufacturing facilities at home and abroad, including ship block fabrication factories in Ningbo and Rongcheng, China. The Geoje Shipyard in particular, SHI's largest shipyard in South Korea, boasts the highest dock turnover rate in the world. The largest of the three docks, Dock No. 3, is 640 metres long, 97.5 metres wide, and 13 metres deep."},
{"name": ["Sony Group Corp"], "stock_Value": ["€79.40"], "time": ["Nov 24, 3:31:21 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€80.90"], "day_range": ["€78.45 - €79.40"], "volume": ["€70.22 - €93.80"], "market_segment": ["-"], "info": "Sony Group Corporation, formerly known as Tokyo Tsushin Kogyo K.K. and Sony Corporation, is a Japanese multinational conglomerate corporation headquartered in Minato, Tokyo, Japan. The Sony Group comprises entities such as Sony Corporation, Sony Semiconductor Solutions, Sony Entertainment, Sony Interactive Entertainment, Sony Financial Group, and others. Sony was established in 1946 as Tokyo Tsushin Kogyo by Masaru Ibuka and Akio Morita. This electronics company, known for creating products such as the transistor radio TR-55, the home video tape recorder CV-2000, the portable audio player Walkman, and the compact disc player CDP-101, embarked on diverse business ventures. In 1988, Sony acquired CBS Records, and in 1992, it acquired Columbia Pictures. The company also introduced the home video game console PlayStation. In Japan, Sony expanded into the financial sector. In 2021, Sony transformed into a holding company, handing over the name Sony Corporation to its subsidiary electronics company."},
{"name": ["Orica Ltd"], "stock_Value": ["$15.60"], "time": ["Nov 24, 7:00:00 PM GMT+11 · AUD · ASX ·"], "previous_close": ["$15.70"], "day_range": ["$15.60 - $15.77"], "volume": ["$13.81 - $17.07"], "market_segment": ["971.86K"], "info": "Orica Limited is an Australian-based multinational corporation that is one of the world's largest providers of commercial explosives and blasting systems to the mining, quarrying, oil and gas, and construction markets, a supplier of sodium cyanide for gold extraction, and a specialist provider of ground support services in mining and tunnelling. Orica has a workforce of around 15,000 employees and contractors, servicing customers across more than 100 countries. Orica is listed on the Australian Securities Exchange. It has in recent years been subject to a number of high-profile industrial accidents and fatalities."},
{"name": ["JinkoSolar Holding Co., Ltd"], "stock_Value": ["€31.80"], "time": ["Nov 24, 3:34:31 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€33.00"], "day_range": ["€31.80 - €32.75"], "volume": ["€24.00 - €56.55"], "market_segment": ["-"], "info": "JinkoSolar Holding Co., Ltd. is a solar panel manufacturer headquartered in Shanghai, China. The company started out as a wafer manufacturer in 2006 and went public on the New York Stock Exchange in 2010. JinkoSolar distributes its solar products and sells to a utility, commercial and residential customers in multiple countries. JinkoSolar is a member of the Silicon Module Super League. The four other original members of the group are Canadian Solar, Hanwha Q CELLS, JA Solar, and Trina Solar. In 2021, the U.S. Customs and Border Protection began blocking the import of JinkoSolar products into the United States due to concerns about the use of forced Uyghur labor. In May 2023, agents from the United States Department of Homeland Security and Federal Bureau of Investigation raided JinkoSolar's offices in Jacksonville, Florida."},
{"name": ["Magna International Inc"], "stock_Value": ["$54.42"], "time": ["Nov 24, 9:48:52 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$54.35"], "day_range": ["$54.23 - $54.72"], "volume": ["$46.71 - $68.92"], "market_segment": ["1.34M"], "info": "Magna International Inc. is a Canadian parts manufacturer for automakers. It is one of the largest companies in Canada and was recognized on the 2020 Forbes Global 2000. The company is the largest automobile parts manufacturer in North America by sales of original equipment parts; it has ranked consistently in the Fortune Global 500 list for 20 years in a row since 2001. It produces automotive systems, assemblies, modules, and components, which are supplied to General Motors, Ford and Stellantis, as well as BMW, Mercedes, Volkswagen, Toyota, Tesla, and Tata Motors, among others. The company is headquartered in Aurora, Ontario, and its chief executive officer is Swamy Kotagiri. It has 158,000 employees in 342 manufacturing operations and 91 product development, engineering and sales centres in 27 countries. Magna is governed under a corporate constitution which calls for distribution of profits to employees and shareholders. The terms of this contract are a \"fair enterprise system\" according to company founder Frank Stronach."},
{"name": ["Begbies Traynor Group plc"], "stock_Value": ["GBX 119.58"], "time": ["Nov 24, 2:33:17 PM UTC · GBX · LON ·"], "previous_close": ["GBX 120.00"], "day_range": ["GBX 117.95 - GBX 123.50"], "volume": ["GBX 105.50 - GBX 150.69"], "market_segment": ["139.14K"], "info": "Begbies Traynor is a firm specialising in corporate restructuring. They were formed in 1989, expanded through mergers and organic growth and were floated in 2004. The company employs over 700 people and has over 100 offices around the United Kingdom."},
{"name": ["Dai Nippon Printing Co Ltd"], "stock_Value": ["¥4,035.00"], "time": ["Nov 24, 5:45:15 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥3,982.00"], "day_range": ["¥4,015.00 - ¥4,042.00"], "volume": ["¥2,497.00 - ¥4,160.00"], "market_segment": ["7.85"], "info": "Dai Nippon Printing, established in 1876, is a Japanese printing company which operates its printing in three areas: information communications, lifestyle and industrial supplies, and electronics. The company is involved in a wide variety of printing processes, ranging from magazines to shadow masks for the production of displays, as well as out-coupling enhancement structures for LCD displays and scattering for display backlights. They employ more than 35,000 people. Dai Nippon also operates Honto.jp, an online \"hybrid\" bookstore that sells both print and digital books."},
{"name": ["TELECOM ARGENTINA SA-SP Common Stock"], "stock_Value": ["$1,580.05"], "time": ["Nov 24, 11:29:36 AM GMT-3 · ARS · BCBA ·"], "previous_close": ["$1,637.95"], "day_range": ["$1,562.15 - $1,650.00"], "volume": ["$273.00 - $1,650.00"], "market_segment": ["135.88K"], "info": "Telecom Argentina S.A. is the major local telephone company for the northern part of Argentina, including the whole of the city of Buenos Aires. Briefly known as Sociedad Licenciataria Norte S.A., it quickly changed its name, and is usually known as simply \"Telecom\" within Argentina. Together with Telefónica de Argentina in the southern part of the country, was part of the national fixed telephone market duopoly, until 8 October 1999. Telecom also operates the mobile phone service Personal, the cable modem service Arnet-Fibertel and the cable operator Cablevisión, now under the brand \"Flow\"."},
{"name": ["Ampol Ltd"], "stock_Value": ["$34.10"], "time": ["Nov 24, 7:00:00 PM GMT+11 · AUD · ASX ·"], "previous_close": ["$33.89"], "day_range": ["$33.92 - $34.34"], "volume": ["$26.50 - $35.46"], "market_segment": ["679.03K"], "info": "Ampol Limited is an Australian petroleum company headquartered in Sydney, New South Wales. Ampol is the largest transport energy distributor and retailer in Australia, with more than 1,900 Ampol-branded stations across the country as of October 2022. Ampol also operates in New Zealand through its subsidiary Z Energy. Ampol was first incorporated in 1936 and would later be owned by what is now Hanson Australia. The Caltex brand in Australia separately began in 1941 to market petrol in its chain of service stations and was owned by Caltex Australia Limited. In 1995, the Ampol and Caltex operations merged to form Australian Petroleum, equally owned by Pioneer and Caltex Australia. Pioneer sold its shareholding between 1997 and 1998, and Caltex Australia gained full ownership of Australian Petroleum. Caltex Australia then gradually replaced the Ampol brand with Caltex over the next decade. From 2001 until 2015, Caltex Australia was owned equally by American petroleum company Chevron Corporation and the Australian public until Chevron sold its shareholding to the public."},
{"name": ["Keio Corp"], "stock_Value": ["¥4,161.00"], "time": ["Nov 24, 5:45:16 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥4,109.00"], "day_range": ["¥4,095.00 - ¥4,162.00"], "volume": ["¥4,034.00 - ¥5,433.00"], "market_segment": ["19.48"], "info": "Keio Corporation is a private railway operator in Tokyo, Japan, and the central firm of the Keio Group that is involved in transport, retail, real estate and other industries. The name \"Keio\" is derived from taking one character each from the places through which the railway runs: \"Tōkyō\" and \"Hachiōji\". The Keio railway network connects the western suburbs of Tokyo and Sagamihara in Kanagawa with central Tokyo at Shinjuku Station."},
{"name": ["Drecom Co Ltd"], "stock_Value": ["¥704.00"], "time": ["Nov 24, 5:37:05 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥686.00"], "day_range": ["¥685.00 - ¥715.00"], "volume": ["¥457.00 - ¥868.00"], "market_segment": ["-"], "info": "Drecom Co., Ltd. is a Japanese software, web, and video game development and video game publishing company. Subsidiaries Drecom Media and DRE Novels publish light novels."},
{"name": ["Hartford Financial Services Group Inc"], "stock_Value": ["$78.02"], "time": ["Nov 24, 9:49:51 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$77.75"], "day_range": ["$77.68 - $78.17"], "volume": ["$64.25 - $79.44"], "market_segment": ["1.70M"], "info": "The Hartford Financial Services Group, Inc., usually known as The Hartford, is a United States-based investment and insurance company. The Hartford is a Fortune 500 company headquartered in its namesake city of Hartford, Connecticut. It was ranked 160th in Fortune 500 in the year of 2020. The company's earnings are divided between property-and-casualty operations, group benefits and mutual funds. The Hartford is the 13th-largest property and casualty insurance company in the United States. It sells products primarily through a network of agents and brokers, and has also been the auto and home insurance writer for AARP members for more than 25 years."},
{"name": ["Molson Coors Beverage Co Class B"], "stock_Value": ["$60.16"], "time": ["Nov 24, 9:47:40 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$60.02"], "day_range": ["$59.95 - $60.22"], "volume": ["$48.49 - $70.90"], "market_segment": ["1.57M"], "info": "Molson Coors is a Canadian-American multinational drink and brewing company headquartered in Chicago, IL with main offices in Golden, Colorado, and Montreal, Quebec. Molson Coors was formed in 2005 through the merger of Molson of Canada, and Coors of the United States. In 2016, Molson Coors acquired Miller Brewing Company for approximately US$12 billion. The agreement made Molson Coors the world's third largest brewer. Molson Coors is a publicly traded company on both the New York Stock Exchange and Toronto Stock Exchange. Molson Coors has been a constituent of the S&P500 since 2005."},
{"name": ["Haseko Corp"], "stock_Value": ["¥1,819.50"], "time": ["Nov 24, 5:45:11 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥1,808.50"], "day_range": ["¥1,808.50 - ¥1,828.00"], "volume": ["¥1,427.00 - ¥1,995.50"], "market_segment": ["7.86"], "info": "Haseko Corporation is a Japanese construction company specialized in construction of condominium units. From 1968 to 2015, the company built a total of around 580,000 condominium units, which is approximately 10% of the total number of condominium units on the market in Japan. The company is highly vertically integrated, with all of the lifecycle of condominium construction and maintenance handled by the company or its subsidiaries. On October 1, 2015, Haseko Corporation was included in the Nikkei 225 stock market index."},
{"name": ["China Travel ntrntnl nvstmnt Hng Kng Ltd"], "stock_Value": ["€0.16"], "time": ["Nov 24, 1:44:24 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€0.16"], "day_range": ["€0.16 - €0.16"], "volume": ["€0.15 - €0.22"], "market_segment": ["-"], "info": "China Travel International Investment Hong Kong Limited is an investment holding company engaged in travel, theme park, hotel, resort, passenger transportation, golf club, power generation, freight forwarding, and other investments. It was established and listed in Hong Kong in 1992 as a subsidiary of China Travel Service. Hong Kong has been an established as the central business and financial center for China and Asia. Although technically in China, it is governed independently, and therefore it must accrue its own funds to promote travel. Hong Kong is also considered a major hub to many airlines in Asia. Many people stop in Hong Kong from Europe on their way to Australia on business class flights. There are many business class flights to and from Hong Kong – in fact, several airlines have flights with only business class seats. Hong Kong International Airport is a major connection point to the rest of the world and every other continent."},
{"name": ["Deutsche Wohnen SE"], "stock_Value": ["€21.48"], "time": ["Nov 24, 2:15:24 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€21.52"], "day_range": ["€21.48 - €21.58"], "volume": ["€16.70 - €24.00"], "market_segment": ["-"], "info": "Deutsche Wohnen SE is a German property company, and one of the 30 companies that compose the DAX index. Previously listed on the MDAX, it replaced Lufthansa on the DAX after Lufthansa was downgraded to the MDAX because of losses during the COVID-19 pandemic. Germany's largest real estate company for private apartments Vonovia took over Deutsche Wohnen, the second largest German company in 2021. Vonovia acquired additional shares and now holds 87.6 percent of Deutsche Wohnen. This created a European real estate giant with around 568,000 apartments."},
{"name": ["Calix Ltd"], "stock_Value": ["$3.37"], "time": ["Nov 24, 7:00:00 PM GMT+11 · AUD · ASX ·"], "previous_close": ["$3.33"], "day_range": ["$3.33 - $3.46"], "volume": ["$2.41 - $6.05"], "market_segment": ["299.15K"], "info": "Calix Limited is an Australian technology company whose core technology is a \"kiln\" built in Bacchus Marsh that produces \"mineral honeycomb\". Calix's technology includes work on CO₂ capture to address global sustainability challenges across several industries including wastewater treatment, aquaculture, advanced energy storage and cement / lime production."},
{"name": ["Bpost SA"], "stock_Value": ["€5.08"], "time": ["Nov 24, 3:10:38 PM GMT+1 · EUR · EBR ·"], "previous_close": ["€5.01"], "day_range": ["€5.00 - €5.11"], "volume": ["€3.85 - €5.76"], "market_segment": ["184.34K"], "info": "Bpost, also known as the Belgian Post Group, is the Belgian company responsible for the delivery of national and international mail. The Belgian Post Group is one of the largest civilian employers in Belgium. It provides a range of postal, courier, direct marketing, banking, insurance, and electronic services in a highly competitive European market. The headquarters are located in Brussels at the Muntcenter. Before 2010, it was known as De Post in Dutch and La Poste in French, meaning \"the Post\" in each case in English."},
{"name": ["Garden Reach Shipbuilders & Enginers Ltd"], "stock_Value": ["₹833.00"], "time": ["Nov 24, 3:59:58 PM GMT+5:30 · INR · NSE ·"], "previous_close": ["₹833.80"], "day_range": ["₹829.50 - ₹844.95"], "volume": ["₹392.50 - ₹974.80"], "market_segment": ["34.50"], "info": "Garden Reach Shipbuilders & Engineers Ltd, abbreviated as GRSE, is one of India's leading shipyards, located in Kolkata. It builds and repairs commercial and naval vessels. GRSE also builds export ships. Founded in 1884 as a small privately-owned company on the eastern bank of the Hooghly River, it was renamed as Garden Reach Workshop in 1916. The company was nationalised by the Government of India in 1960. It was awarded the Miniratna status, with accompanying financial and operational autonomy in September 2006. It is first Indian shipyard to build 100 warships."},
{"name": ["Balaji Telefilms Ltd"], "stock_Value": ["₹67.00"], "time": ["Nov 24, 3:58:03 PM GMT+5:30 · INR · NSE ·"], "previous_close": ["₹68.15"], "day_range": ["₹66.80 - ₹68.85"], "volume": ["₹35.00 - ₹80.10"], "market_segment": ["24.26"], "info": "Balaji Telefilms is an Indian company that produces Indian soap operas, reality TV, comedy, game shows, entertainment, and factual programming in several Indian languages. Balaji Telefilms is promoted by Ekta Kapoor and Shobha Kapoor and is a public company listed at Bombay Stock Exchange and National Stock Exchange of India. In the 2000s the company went on to produce some historic blockbusters which include, Kyunki Saas Bhi Kabhi Bahu Thi, Kahaani Ghar Ghar Kii, Kaahin Kissii Roz, Kasautii Zindagii Kay, Kahiin to Hoga, Kkusum and Kasamh Se amongst several others. In the 2010s the company went on to produce several hugely successful drama series which includes Pavitra Rishta, Tere Liye, Pyaar Kii Ye Ek Kahaani, Bade Achhe Lagte Hain, Jodha Akbar, Yeh Hai Mohabbatein, Kumkum Bhagya, Meri Aashiqui Tum Se Hi, Kasam Tere Pyaar Ki, Kundali Bhagya, Yeh Hai Chahatein and Bhagya Lakshmi. Since 2015, the company introduced several seasonal format weekend drama thriller series which went out to be highly rated series amongst which includes Naagin, Kavach, Brahmarakshas, Haiwaan: The Monster, Daayan and Qayamat Ki Raat amongst several others."},
{"name": ["SAP SE"], "stock_Value": ["€141.42"], "time": ["Nov 24, 3:24:28 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€141.82"], "day_range": ["€141.20 - €141.98"], "volume": ["€95.60 - €142.00"], "market_segment": ["30.97"], "info": "SAP SE is a German multinational software company based in Walldorf, Baden-Württemberg. It develops enterprise software to manage business operations and customer relations. The company is the world's leading enterprise resource planning software vendor. SAP is the largest non-American software company by revenue and the world's third-largest publicly traded software company by revenue. Apart from ERP software, the company also sells database software and technology, cloud-engineered systems, and other ERP software products, such as human capital management software, customer relationship management software, enterprise performance management software, product lifecycle management software, supplier relationship management software, supply chain management software, business technology platform software and programming environment SAP AppGyver for business. Historical references include Systems, Applications, and Products in Data Processing, SAP AG and SAP SE."},
{"name": ["Paramount Resources Ltd"], "stock_Value": ["$27.00"], "time": ["Nov 24, 9:35:06 AM GMT-5 · CAD · TSE ·"], "previous_close": ["$27.00"], "day_range": ["$27.00 - $27.27"], "volume": ["$25.05 - $33.80"], "market_segment": ["6.45"], "info": "Paramount Resources Ltd. is a Canadian petroleum company, founded in 1976. The company is involved in the exploration, development, production, processing, transportation and marketing of natural gas and its byproducts and crude oil. The company was founded by Clay Riddell. In addition to its own name, Paramount has several subsidiaries with names resembling those of Hollywood companies, including Fox Drilling, Summit Resources, and Pixar Petroleum. It also retains significant investment in MGM Energy, which it spun off in 2007. In 2017, Paramount acquired Apache Canada Ltd. for C$459.5 million and merged with Trilogy Energy Corp which itself was originally spun-off from Paramount. Paramount reported an output of 85,941 barrels of oil equivalent per day in its 2018 annual report, published in March 2019."},
{"name": ["Morningstar Inc"], "stock_Value": ["$274.75"], "time": ["Nov 24, 9:49:38 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$276.45"], "day_range": ["$274.75 - $277.00"], "volume": ["$163.28 - $277.00"], "market_segment": ["173.47K"], "info": "Morningstar, Inc. is an American financial services firm headquartered in Chicago, Illinois, and was founded by Joe Mansueto in 1984. It provides an array of investment research and investment management services. With operations in 29 countries, Morningstar's research and recommendations are considered by financial journalists as influential in the asset management industry, and a positive or negative recommendation from Morningstar analysts can drive money into or away from any given fund. Through its asset management division, the firm currently manages over US$295 billion as of March 31, 2023. The firm also provides software and data platforms for investment professionals, including \"Morningstar Research Portal\", \"Morningstar Direct\" and \"Morningstar Advisor Workstation\"."},
{"name": ["KEYEAST Co., Ltd."], "stock_Value": ["₩7,050.00"], "time": ["Nov 24, 6:31:12 PM GMT+9 · KRW · KOSDAQ ·"], "previous_close": ["₩7,030.00"], "day_range": ["₩6,960.00 - ₩7,140.00"], "volume": ["₩6,020.00 - ₩11,980.00"], "market_segment": ["40.48K"], "info": "KeyEast is a management agency founded by actor Bae Yong-joon."},
{"name": ["Manulife Financial Corp"], "stock_Value": ["$19.24"], "time": ["Nov 24, 9:50:02 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$19.05"], "day_range": ["$19.13 - $19.25"], "volume": ["$17.07 - $20.40"], "market_segment": ["3.18M"], "info": "Manulife Financial Corporation is a Canadian multinational insurance company and financial services provider headquartered in Toronto, Ontario. The company operates in Canada and Asia as \"Manulife\" and in the United States primarily through its John Hancock Financial division. As of December 2021, the company employed approximately 38,000 people and had 119,000 agents under contract, and has CA$1.4 trillion in assets under management and administration. Manulife at one point serviced over 26 million customers worldwide. Manulife is the largest insurance company in Canada and the 28th largest fund manager in the world based on worldwide institutional assets under management. Manulife Bank of Canada is a wholly owned subsidiary of Manulife."},
{"name": ["Finnair Oyj"], "stock_Value": ["€0.035"], "time": ["Nov 24, 2:15:52 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€0.035"], "day_range": ["€0.029 - €0.035"], "volume": ["€0.029 - €0.10"], "market_segment": ["1.43"], "info": "Finnair is the flag carrier and largest full-service legacy airline of Finland, with headquarters in Vantaa on the grounds of Helsinki Airport, its hub. Finnair and its subsidiaries dominate both domestic and international air travel in Finland. Its major shareholder is the government of Finland, which owns 55.9% of its shares. Finnair is a member of the Oneworld airline alliance. Finnair is the sixth oldest airline in continuous operation and is consistently listed as one of the safest in the world. The company's slogans are Designed for you and The Nordic Way."},
{"name": ["Wintrust Financial Corp"], "stock_Value": ["$83.78"], "time": ["Nov 24, 9:50:18 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$83.99"], "day_range": ["$83.49 - $84.21"], "volume": ["$57.48 - $95.97"], "market_segment": ["457.27K"], "info": "Wintrust is a financial holding company in the United States that operates 15 chartered community banks in northern Illinois and southern Wisconsin. Wintrust is a relatively medium-sized banking institution in the United States and it trades on the Nasdaq Global Select Market with stock symbol WTFC. Wintrust is the second largest banking company in Chicago."},
{"name": ["YAMABIKO CORPORATION"], "stock_Value": ["¥1,487.00"], "time": ["Nov 24, 5:45:14 PM GMT+9 · JPY · TYO ·"], "previous_close": ["¥1,470.00"], "day_range": ["¥1,469.00 - ¥1,489.00"], "volume": ["¥1,055.00 - ¥1,628.00"], "market_segment": ["8.65"], "info": "The Yamabiko Corporation is a Japanese manufacturer of power tools formed with the September 2008 merger of the Kioritz and Shindaiwa corporations. The brands owned and distributed by Yamabiko are Kioritz, Shindaiwa and Echo. The Yamabiko Corporation is based in Ome, Japan. Yambiko exports parts to their Lake Zurich, Illinois and assemble Echo and Shindaiwa products for sale in the USA."},
{"name": ["Cencora Inc"], "stock_Value": ["$200.22"], "time": ["Nov 24, 9:50:09 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$199.68"], "day_range": ["$199.75 - $201.27"], "volume": ["$171.65 - $201.27"], "market_segment": ["1.44M"], "info": "Cencora, Inc., formerly known as AmerisourceBergen, is an American drug wholesale company that was formed by the merger of Bergen Brunswig and AmeriSource in 2001."},
{"name": ["Lotte Chemical Corp"], "stock_Value": ["₩154,600.00"], "time": ["Nov 24, 6:26:18 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩154,700.00"], "day_range": ["₩154,000.00 - ₩156,700.00"], "volume": ["₩126,300.00 - ₩194,300.00"], "market_segment": ["110.37K"], "info": "Lotte Chemical Corporation is a chemical company headquartered in Seoul, South Korea. Lotte Chemical is one of the largest chemical companies in the world by revenue. Lotte Chemical manufactures synthetic resins and other chemical products used for various industrial materials."},
{"name": ["Advantage Energy Ltd"], "stock_Value": ["$10.27"], "time": ["Nov 24, 9:30:00 AM GMT-5 · CAD · TSE ·"], "previous_close": ["$10.35"], "day_range": ["$10.27 - $10.27"], "volume": ["$6.79 - $11.92"], "market_segment": ["10.71"], "info": "Advantage Energy Ltd. is a Canadian oil and gas company based in Calgary, Alberta. The company is focused on the development of its Montney fossil gas and liquids resource play to provide Canadian energy. In 2019, it produced 45,833 barrels of oil equivalent per day, with 94% of production consisting of natural gas and 6% light oil and liquids with a low emission intensity of 4 kg CO2e/boe. It is listed on the Toronto Stock Exchange under the symbol TSX: AAV."},
{"name": ["Fortive Corp"], "stock_Value": ["$67.82"], "time": ["Nov 24, 9:49:51 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$67.83"], "day_range": ["$67.73 - $68.00"], "volume": ["$62.70 - $79.90"], "market_segment": ["2.47M"], "info": "Fortive Corporation is an American industrial technology conglomerate company headquartered in Everett, Washington. The company specialises in providing essential technologies for connected workflow solutions; designing, developing, manufacturing and distributing professional and engineered products, software and services. Their products and services are split into three strategic segments; Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions. As of December 2022, Fortive has over 18,000 employees in 60 countries worldwide. Fortive was spun off from Danaher in July 2016. Brothers Steven and Mitchell Rales, Danaher's founders, retained board seats with Fortive after the separation. At the point of its independent incorporation, Fortive immediately became a component of the S&P 500. Later the transportation, automation and franchise distribution businesses would be spun off. In 2018 and 2019, Fortune named Fortive as a Future 50 company. In 2020, Fortune named Fortive one of the world's most admired companies."},
{"name": ["Chongqing Changan Automobile Ord Shs B"], "stock_Value": ["$3.83"], "time": ["Nov 24, 4:29:47 PM GMT+8 · HKD · SHE ·"], "previous_close": ["$3.80"], "day_range": ["$3.79 - $3.88"], "volume": ["$3.12 - $4.06"], "market_segment": ["4.00M"], "info": "Chang'an Automobile Co., Ltd. is a Chinese state-owned automobile manufacturer headquartered in Jiangbei, Chongqing. Founded in 1862, it is China's oldest automobile maker. It is currently the smallest of the \"Big Four\" state-owned car manufacturers of China, namely: SAIC Motor, FAW Group, Dongfeng Motor Corporation, and Changan Automobile, with car sales of 5.37 million, 3.50 million, 3.28 million and 2.30 million in 2021 respectively. The company produces and sells vehicles under its own branding, such as Changan, Oshan, Kaicene, as well as under foreign-branded joint ventures such as Changan-Ford and Changan-Mazda. In 2021, domestic branded cars took over 76% of sales. Its principal activity is the production of passenger cars, microvans, commercial vans and light trucks. It is China's second most popular car brand, with 1.4 million Changan cars sold in 2016. A subsidiary of Changan, Chongqing Changan Automobile Company, is listed on the Shenzhen Stock Exchange."},
{"name": ["Netmarble Corp"], "stock_Value": ["₩55,500.00"], "time": ["Nov 24, 6:29:06 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩54,300.00"], "day_range": ["₩53,500.00 - ₩55,700.00"], "volume": ["₩36,750.00 - ₩73,300.00"], "market_segment": ["243.59K"], "info": "Netmarble Corp. is a South Korean mobile game developer. It is South Korea's largest mobile-gaming company which was founded in 2000 by Bang Jun-hyuk."},
{"name": ["Prada S.p.A."], "stock_Value": ["€5.14"], "time": ["Nov 24, 2:12:45 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€5.24"], "day_range": ["€5.04 - €5.14"], "volume": ["€4.86 - €7.13"], "market_segment": ["-"], "info": "Prada S.p.A. is an Italian luxury fashion house founded in 1913 in Milan by Mario Prada. It specializes in leather handbags, travel accessories, shoes, ready-to-wear, and other fashion accessories. Prada licenses its name and branding to Luxottica for eyewear and L’Oréal for fragrances and cosmetics. Founded in 1913 and named for the family of founder Mario Prada, the company originally sold imported English animal goods before transitioning to waterproof nylon fabrics in the 1970s under the leadership of Mario's granddaughter, Miuccia Prada and her husband Patrizio Bertelli. By the 1990s, Prada was perceived as a luxury brand, a designation credited to originality in its designs. To further the business, Miuccia Prada founded Miu Miu as a subsidiary of Prada around this time period; the company additionally partnered with LVMH to acquire a joint stake in Fendi; Prada further assisted LVMH in its failed takeover of Gucci. The brand struggled through the late 2000s and early to mid 2010s, which included a failed initial public offering on the Hong Kong Stock Exchange, though began a resurgence in popularity entering into the 2020s."},
{"name": ["Ubiquiti Inc"], "stock_Value": ["$114.01"], "time": ["Nov 24, 9:46:48 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$115.01"], "day_range": ["$114.01 - $114.25"], "volume": ["$103.00 - $304.75"], "market_segment": ["107.97K"], "info": "Ubiquiti Inc. is an American technology company founded in San Jose, California, in 2003. Now based in New York City, Ubiquiti manufactures and sells wireless data communication and wired products for enterprises and homes under multiple brand names. On October 13, 2011, Ubiquiti had its initial public offering at 7.04 million shares, at $15 per share, raising $30.5 million."},
{"name": ["Learning Tree International Inc"], "stock_Value": ["$0.20"], "time": ["Nov 22, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$0.20"], "day_range": ["$0.20 - $1.05"], "volume": ["2.64M USD"], "market_segment": ["-"], "info": "Learning Tree International, Inc., founded in 1974, is an IT training company based in Herndon, Virginia, United States. They offer training for business and technology skills. In 2010, the company had a revenue of $127.47 million."},
{"name": ["Gerova Financial Group Ltd"], "stock_Value": ["$0.00010"], "time": ["Nov 14, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$0.00"], "day_range": ["$0.00010 - $0.00010"], "volume": ["2.79K USD"], "market_segment": ["-"], "info": "GEROVA Financial Group, Ltd is an international reinsurance company with operating insurance subsidiaries in Bermuda, Barbados, and Ireland."},
{"name": ["Inner Mongolia Yitai Coal Ord Shs B"], "stock_Value": ["$1.40"], "time": ["Nov 24, 3:59:53 PM GMT+8 · USD · SHA ·"], "previous_close": ["$1.38"], "day_range": ["$1.37 - $1.40"], "volume": ["$1.28 - $1.55"], "market_segment": ["1.24M"], "info": "The Inner Mongolia Yitai Coal Company is an Ordos City-based coal company founded in 1997. The company works in the mining, production, transport, and sale of coal and coal-based products in Inner Mongolia and China. It is a subsidiary of Inner Mongolia Yitai Group Co., Ltd. It has the seventh largest reserve of coal in the world measured by potential carbon emissions."},
{"name": ["Merck & Co Inc"], "stock_Value": ["€93.30"], "time": ["Nov 24, 3:35:32 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€93.70"], "day_range": ["€93.00 - €93.70"], "volume": ["€92.40 - €109.40"], "market_segment": ["950.00"], "info": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey, and is named for Merck Group, founded in Germany in 1668, of whom it was once the American arm. The company does business as Merck Sharp & Dohme or MSD outside the United States and Canada. It is one of the largest pharmaceutical companies in the world, generally ranking in the global top five by revenue. Merck & Co. was originally established as the American affiliate of Merck Group in 1891. Merck develops and produces medicines, vaccines, biologic therapies and animal health products. It has multiple blockbuster drugs or products each with 2020 revenues including cancer immunotherapy, anti-diabetic medication and vaccines against HPV and chickenpox. The company is ranked 71st on the 2022 Fortune 500 and 87th on the 2022 Forbes Global 2000, both based on 2021 revenues."},
{"name": ["Grifols SA - ADR ADR Class B"], "stock_Value": ["$9.82"], "time": ["Nov 24, 9:50:43 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$9.66"], "day_range": ["$9.76 - $9.97"], "volume": ["$6.50 - $10.97"], "market_segment": ["677.32K"], "info": "Grifols, S.A. is a Spanish multinational pharmaceutical and chemical manufacturer. Principally a producer of blood plasma-based products, a field in which it is the European leader and largest worldwide, the company also supplies devices, instruments, and reagents for clinical testing laboratories."},
{"name": ["Orange SA"], "stock_Value": ["€11.15"], "time": ["Nov 24, 2:08:34 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€11.06"], "day_range": ["€11.15 - €11.15"], "volume": ["€9.10 - €11.85"], "market_segment": ["18.28"], "info": "Orange S.A., formerly France Télécom S.A. is a French multinational telecommunications corporation. It has 266 million customers worldwide and employs 89,000 people in France and 59,000 people elsewhere. In 2015, the group had a revenue of €40 billion. The company's head office is located in Issy-les-Moulineaux. Orange has been the company's main brand for mobile, landline, internet and Internet Protocol television services since 2006. The Orange brand originated in the United Kingdom in 1994 after Hutchison Whampoa acquired a controlling stake in Microtel Communications: that company became a subsidiary of Mannesmann in 1999 and then was acquired by France Télécom in 2000. The France Télécom company was rebranded to Orange on 1 July 2013. The company has faced criticism due to the Orange S.A. suicides."},
{"name": ["Tallinna Sadam AS"], "stock_Value": ["€1.14"], "time": ["Nov 24, 3:59:52 PM GMT+2 · EUR · TAL ·"], "previous_close": ["€1.13"], "day_range": ["€1.13 - €1.14"], "volume": ["€1.12 - €1.50"], "market_segment": ["32.23K"], "info": "Port of Tallinn is the biggest port authority in Estonia. Taking into account both cargo and passenger traffic, it is one of the largest port enterprises of the Baltic Sea. Port of Tallinn is a publicly listed company managing five constituent ports: Tallinn Passenger Port / Old City Harbour – the main passenger harbour in Estonia; located in the centre of Tallinn; one of the busiest passenger ports of the Baltic Sea Muuga Harbour – the largest cargo harbour in Estonia, located in Maardu, 13 km northeast of Tallinn city centre Paldiski South Harbour – a cargo harbour in Paldiski, 40 km west from Tallinn Paljassaare Harbour – a small cargo harbour a few kilometres northwest of Tallinn city centre in Paljassaare Saaremaa Harbour – a passenger harbour on the island of Saaremaa, in Ninase In October 2016, the Port of Tallinn subsidiary TS Laevad took over operation of the ferry routes between the Estonian mainland and the islands of Saaremaa and Hiiumaa. Under the subsidiary, TS Shipping, the Port of Tallinn owns and operates icebreaker MSV Botnica."},
{"name": ["Amadeus It Group SA"], "stock_Value": ["€62.98"], "time": ["Nov 24, 3:35:07 PM GMT+1 · EUR · BME ·"], "previous_close": ["€62.76"], "day_range": ["€62.58 - €63.04"], "volume": ["€48.36 - €70.22"], "market_segment": ["683.96K"], "info": "Amadeus IT Group, S.A. is a major Spanish multinational technology company that provides software solutions for the global travel and tourism industry. It is the world's leading provider of travel technology that focus on developing software for airlines, hotels, travel agencies, and other travel-related businesses to enhance their operations and customer experiences. The company is structured around two areas: its global distribution system and its Information Technology business. Amadeus provides search, pricing, booking, ticketing and other processing services in real-time to travel providers and travel agencies through its Amadeus CRS distribution business area. It also offers computer software that automates processes such as reservations, inventory management software and departure control systems. It services customers including airlines, hotels, tour operators, insurers, car rental and railway companies, ferry and cruise lines, travel agencies and individual travellers directly. Amadeus processed 945 million billable travel transactions in 2011. The parent company of Amadeus IT Group, holding over 99.7% of the firm, is Amadeus IT Holding S.A."},
{"name": ["Csl ADR"], "stock_Value": ["$83.02"], "time": ["Nov 24, 9:33:10 AM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$84.70"], "day_range": ["$83.02 - $87.32"], "volume": ["$71.51 - $110.25"], "market_segment": ["109.95K"], "info": "CSL Limited is an Australian multinational specialty biotechnology company that researches, develops, manufactures, and markets products to treat and prevent serious human medical conditions. CSL's product areas include blood plasma derivatives, vaccines, antivenom, and cell culture reagents used in various medical and genetic research and manufacturing applications. The company was established in 1916 as Commonwealth Serum Laboratories and was wholly owned by the Australian federal government until its privatisation in 1994."},
{"name": ["Zhejiang Supor Co Ltd"], "stock_Value": ["¥51.26"], "time": ["Nov 24, 4:29:45 PM GMT+8 · CNY · SHE ·"], "previous_close": ["¥50.67"], "day_range": ["¥50.28 - ¥51.30"], "volume": ["¥44.17 - ¥58.50"], "market_segment": ["1.34M"], "info": "Supor, full name Zhejiang Supor Co., Ltd., is a Chinese cookware and small appliances company, headquartered in Binjiang District, Hangzhou, Zhejiang, China. It was founded in 1994. In 2006 it was the largest such company in China. That year Groupe SEB, a French company, paid 2.37 billion yuan to acquire Supor. It was the first Chinese cookware company to be listed on a stock market."},
{"name": ["Burberry Group plc"], "stock_Value": ["$19.80"], "time": ["Nov 17, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$21.38"], "day_range": ["$19.80 - $19.84"], "volume": ["$19.80 - $33.10"], "market_segment": ["1.24K"], "info": "Burberry Group plc is a British luxury fashion house established in 1856 by Thomas Burberry and headquartered in London, England. It designs and distributes ready to wear, including trench coats, leather accessories, and footwear."},
{"name": ["Deutsche Wohnen SE Unsponsored ADR"], "stock_Value": ["€10.70"], "time": ["Nov 24, 2:02:35 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€10.60"], "day_range": ["€10.70 - €10.70"], "volume": ["€8.25 - €11.80"], "market_segment": ["-"], "info": "Deutsche Wohnen SE is a German property company, and one of the 30 companies that compose the DAX index. Previously listed on the MDAX, it replaced Lufthansa on the DAX after Lufthansa was downgraded to the MDAX because of losses during the COVID-19 pandemic. Germany's largest real estate company for private apartments Vonovia took over Deutsche Wohnen, the second largest German company in 2021. Vonovia acquired additional shares and now holds 87.6 percent of Deutsche Wohnen. This created a European real estate giant with around 568,000 apartments."},
{"name": ["AirAsia Indonesia Tbk PT"], "stock_Value": ["Rp 132.00"], "time": ["Nov 24, 4:40:00 PM GMT+7 · IDR · IDX ·"], "previous_close": ["Rp 131.00"], "day_range": ["Rp 131.00 - Rp 134.00"], "volume": ["Rp 113.00 - Rp 230.00"], "market_segment": ["209.48K"], "info": "PT Indonesia AirAsia, operating as Indonesia AirAsia, is an Indonesian low-cost airline based in Tangerang, Banten. It operates scheduled domestic and international services and is an Indonesian associate carrier of the Malaysian AirAsia. Its main base is Soekarno–Hatta International Airport in Jakarta. Indonesia AirAsia is listed in category 1 by the Indonesian Civil Aviation Authority for airline safety quality."},
{"name": ["Bristol-Myers Squibb Co"], "stock_Value": ["€45.25"], "time": ["Nov 24, 2:34:56 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€45.00"], "day_range": ["€45.15 - €45.35"], "volume": ["€44.00 - €77.11"], "market_segment": ["-"], "info": "The Bristol-Myers Squibb Company, doing business as Bristol Myers Squibb, is an American multinational pharmaceutical company. Headquartered in Princeton, New Jersey, BMS is one of the world's largest pharmaceutical companies and consistently ranks on the Fortune 500 list of the largest U.S. corporations. For fiscal 2022, it had a total revenue of $46.2 billion. Bristol Myers Squibb manufactures prescription pharmaceuticals and biologics in several therapeutic areas, including cancer, HIV/AIDS, cardiovascular disease, diabetes, hepatitis, rheumatoid arthritis, and psychiatric disorders. BMS's primary research and development sites are located in Lawrence, New Jersey, Summit, New Jersey, formerly HQ of Celgene, New Brunswick, New Jersey, Redwood City, California, and Seville in Spain, with other sites in Devens and Cambridge, Massachusetts, Braine-l'Alleud, Belgium, Tokyo, Japan, Bangalore, India, and Wirral, United Kingdom. BMS previously had an R&D site in Wallingford, Connecticut."},
{"name": ["Shenzhen Transsion Holdings Co Ltd"], "stock_Value": ["¥119.89"], "time": ["Nov 24, 3:59:51 PM GMT+8 · CNY · SHA ·"], "previous_close": ["¥118.86"], "day_range": ["¥118.25 - ¥120.34"], "volume": ["¥70.50 - ¥156.00"], "market_segment": ["3.69M"], "info": "Transsion Holdings is a Chinese manufacturer of mobile phones based in Shenzhen. It was the largest smartphone manufacturer by sales in Africa in 2017, and also sells mobile phones in the Middle East, Southeast Asia, South Asia, and Latin America. Its brands include phone brands such as Itel, Tecno, Infinix; after-sales service brand Carlcare; and accessories brand Oraimo. It manufactures phones in China, Indonesia, Pakistan, Ethiopia, Bangladesh and recently in India."},
{"name": ["Elia Group SA"], "stock_Value": ["€95.15"], "time": ["Nov 24, 3:35:46 PM GMT+1 · EUR · EBR ·"], "previous_close": ["€99.70"], "day_range": ["€94.75 - €99.80"], "volume": ["€86.25 - €146.10"], "market_segment": ["49.25K"], "info": "Elia is a Belgian transmission system operator for high-voltage electricity, located in Brussels, Belgium. It operates in Belgium and Germany. The company transmits electricity from generators to distribution system operators, which then supply SMEs and homes. Elia also has contracts with major industrial users that directly connect to its high-voltage grid. Elia's main activities include managing grid infrastructure, managing the electrical system and facilitating the market. Elia Group also offers consulting and engineering services through a subsidiary Elia Grid International, founded in 2014."},
{"name": ["Acer Inc (GDR) GDR Reg S"], "stock_Value": ["€4.66"], "time": ["Nov 24, 9:15:04 AM GMT+1 · EUR · FRA ·"], "previous_close": ["€4.66"], "day_range": ["€4.66 - €4.66"], "volume": ["€2.80 - €6.00"], "market_segment": ["-"], "info": "Acer Inc. is a Taiwanese multinational hardware and electronics corporation specializing in advanced electronics technology, headquartered in Xizhi, New Taipei City. Its products include desktop PCs, laptop PCs, tablets, servers, storage devices, virtual reality devices, displays, smartphones and peripherals, as well as gaming PCs and accessories under its Predator brand. Acer is the world's 6th-largest PC vendor by unit sales as of September 2022. In the early 2000s, Acer implemented a new business model, shifting from a manufacturer to a designer, marketer, and distributor of products, while performing production processes via contract manufacturers. Currently, in addition to its core IT products business, Acer also has a new business entity that focuses on the integration of cloud services and platforms, and the development of smartphones and wearable devices with value-added IoT applications."},
{"name": ["Crowdstrike Holdings Inc"], "stock_Value": ["€192.16"], "time": ["Nov 24, 3:31:32 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€192.46"], "day_range": ["€191.98 - €192.24"], "volume": ["€86.14 - €194.34"], "market_segment": ["-"], "info": "CrowdStrike Holdings, Inc. is an American cybersecurity technology company based in Austin, Texas. It provides cloud workload and endpoint security, threat intelligence, and cyberattack response services. The company has been involved in investigations of several high-profile cyberattacks, including the 2014 Sony Pictures hack, the 2015–16 cyber attacks on the Democratic National Committee, and the 2016 email leak involving the DNC."},
{"name": ["NETAC TECHNOLOGY CO., LTD."], "stock_Value": ["¥38.00"], "time": ["Nov 24, 4:29:47 PM GMT+8 · CNY · SHE ·"], "previous_close": ["¥39.11"], "day_range": ["¥37.40 - ¥39.80"], "volume": ["¥11.86 - ¥47.22"], "market_segment": ["16.08M"], "info": "Netac Technology Co., Ltd. is a Chinese data storage company headquartered in Shenzhen. The company claims to be the world's first inventor of USB flash drive, although that claim is disputed by IBM and other manufacturers."},
{"name": ["Bombardier, Inc. Class A"], "stock_Value": ["$37.79"], "time": ["After Hours:"], "previous_close": ["$38.85"], "day_range": ["$37.79 - $37.79"], "volume": ["$29.16 - $53.90"], "market_segment": ["121.00"], "info": "Bombardier Inc. is a Canadian business jet manufacturer. Headquartered in Montreal, the company was founded in 1942 by Joseph-Armand Bombardier to market his snowmobiles and became one of the world's biggest producers of aircraft and trains. In the 1970s and 1980s, the company diversified into public transport vehicles and commercial jets and became a multinational corporation. It grew particularly fast at the end of the 1980s when the turnover multiplied sixfold within six years. At that time it was North America's most important producer of railway vehicles, Canada's most important aerospace producer and the worldwide leading snowmobile manufacturer. The growth came mainly from buying failing government-owned companies at a low price and orchestrating a turnaround. However, the launch of the CSeries aircraft sent the company into deep debt, pushing it to the brink of bankruptcy by 2015. As a result, the company sold nearly all of its operations except business jet manufacturing. Bombardier manufactures several series of corporate jets: Global 7500, Global Express, Challenger 650 and Challenger 3500."},
{"name": ["Sezzle Inc CHESS"], "stock_Value": ["€8.10"], "time": ["Nov 24, 8:11:34 AM GMT+1 · EUR · FRA ·"], "previous_close": ["€7.90"], "day_range": ["€8.10 - €8.10"], "volume": ["€7.90 - €18.32"], "market_segment": ["-"], "info": "Sezzle is a publicly traded financial technology company headquartered in Minneapolis, U.S, with operations in the United States and Canada. The company provides an alternative payment platform offering interest-free installment plans at selected online stores. As of June 2021, the Sezzle platform had over 10 million user sign-ups and over 48,000 participating merchants."},
{"name": ["Lennox International Inc"], "stock_Value": ["$415.51"], "time": ["Nov 24, 9:50:42 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$411.16"], "day_range": ["$409.89 - $416.95"], "volume": ["$232.00 - $416.95"], "market_segment": ["343.02K"], "info": "Lennox International Inc. is a provider of climate control products for the heating, ventilation, air conditioning, and refrigeration markets. The company is based outside Dallas, Texas in the United States and has operations globally."},
{"name": ["ARCADIS NV"], "stock_Value": ["€46.00"], "time": ["Nov 24, 3:35:39 PM GMT+1 · EUR · AMS ·"], "previous_close": ["€46.04"], "day_range": ["€45.84 - €46.20"], "volume": ["€35.84 - €46.26"], "market_segment": ["181.46K"], "info": "Arcadis NV is a global design, engineering and management consulting company based in the Zuidas, Amsterdam, Netherlands. It currently operates in excess of 350 offices across 40 countries. The company is a member of the Next 150 index. Arcadis was founded as the land reclamation specialist Nederlandsche Heidemaatschappij in 1888. Over the following decades, the firm became involved in various development projects, initially with a rural focus. As a consequence of a restructuring in 1972 that divided the company, it became Heidemij. During 1993, the firm merged with the North American business Geraghty & Miller, resulting in its listing on the Nasdaq index. During 1997, the company adopted its current name, Arcadis; subsidiaries were similarly rebranded. Since 1990, the company has largely expanded itself via a series of acquisitions and mergers, which have allowed it to both expand its presence in existing markets as well as to enter new ones. It performs design and consultancy services on a wide variety of undertakings. Arcadis has been involved in several high profile construction projects, including London City Airport and the A2 motorway."},
{"name": ["Pan Ocean Co Ltd"], "stock_Value": ["₩4,220.00"], "time": ["Nov 24, 6:27:16 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩4,280.00"], "day_range": ["₩4,165.00 - ₩4,310.00"], "volume": ["₩4,050.00 - ₩6,870.00"], "market_segment": ["3.48M"], "info": "Pan Ocean Co., Ltd. is a shipping company headquartered in Seoul, South Korea. It is an affiliated company of Harim Group."},
{"name": ["Orange Polska SA"], "stock_Value": ["zł 7.85"], "time": ["Nov 24, 3:36:19 PM GMT+1 · PLN · WSE ·"], "previous_close": ["zł 7.89"], "day_range": ["zł 7.81 - zł 7.96"], "volume": ["zł 6.10 - zł 8.17"], "market_segment": ["2.04M"], "info": "Orange Polska is a Polish telecommunications provider established in December 1991. It is a public company traded on the Warsaw Stock Exchange, with a controlling stake owned by Orange S.A., the latter controlling over 50% of this stake by 2002. It operates the following services: PSTN, ISDN, GSM 900/1800 network, ADSL, IDSL, FTTH fibre Internet, Frame Relay, ATM and Inmarsat."},
{"name": ["HUAYI BROTHERS MEDIA CORPORATION"], "stock_Value": ["¥2.75"], "time": ["Nov 24, 4:29:47 PM GMT+8 · CNY · SHE ·"], "previous_close": ["¥2.76"], "day_range": ["¥2.73 - ¥2.85"], "volume": ["¥2.18 - ¥3.92"], "market_segment": ["54.49M"], "info": "Huayi Brothers Media Corp. is a Chinese multinational entertainment company that owns a film studio, a television production company, a talent agency, a record label, entainterment theme parks, and a movie theater chain founded in Beijing, Shanghai, Hong Kong, Macau, & Taipei by Dennis Wang Zhongjun and James Wang Zhonglei in 1994. The company made world news on October 30, 2009, when the Shenzhen Stock Exchange ChiNext Board was halted, after HBMC's stock price reached 122.74 percent above its IPO price, to open at 63.66 yuan per share. Patrick Frater of Variety called it \"China’s largest private sector film conglomerate\". In 2014, the company was the seventh-largest film distributor in China, with 2.26% of the market."},
{"name": ["Amedisys Inc"], "stock_Value": ["$93.95"], "time": ["Nov 24, 9:51:19 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$93.89"], "day_range": ["$93.84 - $93.97"], "volume": ["$69.36 - $106.02"], "market_segment": ["285.23K"], "info": "Amedisys, Inc. is an American healthcare company based in Baton Rouge, Louisiana. They are one of the largest home health providers and second largest hospice care provider in the United States. Amedisys provides in-home skilled nursing, physical therapy, occupational therapy and speech language pathology, medical social work, home aides, and hospice and bereavement services, with 11 million patient care visits in 2011. Amedisys employs more than 21,000 individuals at more than 500 locations in 39 states and Washington, D.C. In 2010, annual revenues were approximately $1.6 billion. Amedisys was ranked 999 on the Fortune 1000 in 2011. In June 2023, Optum agreed to acquire Amedisys for $3.3 billion."},
{"name": ["Acorn Energy Inc"], "stock_Value": ["$7.75"], "time": ["Nov 22, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$8.09"], "day_range": ["$7.11 - $7.75"], "volume": ["$4.00 - $8.40"], "market_segment": ["882.00"], "info": "Acorn Energy Inc. is a NASDAQ-listed conglomerate investing in electricity generation and security. It was founded by George Morgenstern in 1984 as Decision Systems, Inc. and was taken public by Laidlaw Securities. The name was later changed to Data Systems and Software Inc. John Moore became CEO in 2006 and changed the name to Acorn Factor and later to Acorn Energy."},
{"name": ["Metsa Board Oyj Class B"], "stock_Value": ["€6.95"], "time": ["Nov 24, 4:50:11 PM GMT+2 · EUR · HEL ·"], "previous_close": ["€6.98"], "day_range": ["€6.88 - €7.01"], "volume": ["€6.26 - €8.96"], "market_segment": ["452.23K"], "info": "Metsä Board Oyj, previously known as M-real Corporation, is a leading European producer of premium fresh fibre paperboards including folding boxboards, food service boards and white kraftliners. It was originally established by G.A. Serlachius, and named Metsä-Serla. Metsä Board is part of Metsä Group, one of the largest forest industry groups in the world. On 29 September 2008, M-Real sold four of its paper mills to South African company, Sappi. Nowadays, Metsä Board focuses on folding boxboards, food service boards and white kraftliners and developing better packaging solutions with less environmental impact. Metsä Board has altogether seven production units in Finland and one in Sweden. In the fall of 2020, Metsä Board announced that it would open a competence center in Äänekoski focusing on cardboard and packaging innovations. In the same factory area, among others, Metsä Group's bioproduct factory, cardboard factory, birch veneer factory, wood-based textile fiber test factory and a test factory producing 3D fiber products, which started in May 2022, operate."},
{"name": ["Compagnie d'entreprises CFE SA"], "stock_Value": ["€7.22"], "time": ["Nov 24, 3:21:45 PM GMT+1 · EUR · EBR ·"], "previous_close": ["€7.27"], "day_range": ["€7.10 - €7.25"], "volume": ["€6.20 - €10.50"], "market_segment": ["6.78K"], "info": "CFE is a Belgian company with interested in real estate development, construction & renovation, engineering and investments. The company is listed on Euronext Brussels and is 62.12% owned by Ackermans & van Haaren."},
{"name": ["HiteJinro Co Ltd"], "stock_Value": ["₩22,850.00"], "time": ["Nov 24, 6:23:29 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩22,800.00"], "day_range": ["₩22,700.00 - ₩22,950.00"], "volume": ["₩18,560.00 - ₩27,600.00"], "market_segment": ["424.42K"], "info": "HiteJinro Co., Ltd. is a South Korean multinational drink, brewing and distiller company, founded in 1924. It is the world's leading producer of soju, accounting for more than half of that beverage's domestic sales. It also manufactures a variety of other alcoholic beverages including red wine and whiskey. Distilleries are located in Icheon, Cheongwon, and Masan, with the Masan plant geared toward exports. In addition, Jinro produces the Soksu brand of bottled water at a factory in Cheongwon. In 2006, the company was acquired by Hite, a popular beverage company whose main product is beer. Jinro soju is known by the brand name Chamisul, which is the world's most popular liquor. Part of their marketing strategy is to use temperature sensitive paper on their bottle label. A tab in the shape of an Asiatic Toad is white when the bottle is warm and becomes blue when the bottle is cold, indicating that the soju is ready to drink. Jinro has been named the top-selling spirit in the world in the Millionaires' Club 2016, after selling 73.8m 9-litre in the year 2015."},
{"name": ["Tri Pointe Homes Inc (Delaware)"], "stock_Value": ["$29.23"], "time": ["Nov 24, 9:51:07 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$29.33"], "day_range": ["$29.13 - $29.27"], "volume": ["$17.52 - $34.04"], "market_segment": ["868.73K"], "info": "Tri Pointe Homes, Inc. is a home construction company headquartered in Incline Village, Nevada. It also offers financing and insurance services to homebuyers. It operates in Arizona, California, Nevada, Washington, Colorado, Texas, the District of Columbia, Maryland, North Carolina, South Carolina, and Virginia. The company is the 18th largest home construction company in the United States based on the number of homes closed."},
{"name": ["Yankuang Energy Group Co Ltd ADR"], "stock_Value": ["$17.54"], "time": ["Nov 24, 9:30:01 AM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$17.54"], "day_range": ["$13.70 - $24.29"], "volume": ["17.78B USD"], "market_segment": ["C"], "info": "Yanzhou Coal Mining Company Limited, majority owned by Yankuang Group, is a coal mining company in Mainland China. It is engaged in underground mining coal preparation and sales, and railway transportation service of coal. Its products are mainly low-sulphur coal which is suitable for large-scale power plant and for use in pulverized coal injection."},
{"name": ["Philip Morris International Inc."], "stock_Value": ["€86.10"], "time": ["Nov 24, 3:36:00 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€86.00"], "day_range": ["€85.05 - €86.15"], "volume": ["€82.75 - €99.11"], "market_segment": ["440.00"], "info": "Philip Morris International Inc. is an American multinational tobacco company, with products sold in over 180 countries. The most recognized and best selling product of the company is Marlboro. Philip Morris International is often referred to as one of the companies comprising Big Tobacco. Until spun off in March 2008, Philip Morris International was an operating company of Altria. Altria explained the spin-off, arguing PMI would have more \"freedom,\" i.e. leeway outside the responsibilities and standards of American corporate ownership in terms of potential litigation and legislative restrictions to \"pursue sales growth in emerging markets\", while Altria focuses on the American domestic market. The shareholders in Altria at the time were given shares in PMI, which was listed on the London Stock Exchange and other markets. The company's legal seat is in Stamford, Connecticut, but it does not operate in the United States of America. Philip Morris USA, a subsidiary of PMI's former owner American parent Altria group, owns the Philip Morris brands there. PMI's operational headquarters are in Lausanne, Switzerland."},
{"name": ["Daiichi Sankyo Co Ltd"], "stock_Value": ["$26.71"], "time": ["Nov 22, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$27.34"], "day_range": ["$26.50 - $26.71"], "volume": ["$23.45 - $37.91"], "market_segment": ["4.33K"], "info": "Daiichi Sankyo Company, Limited is a global pharmaceutical company and the second-largest pharmaceutical company in Japan. It achieved JPY 981.8 billion in revenue in 2019. The company owns the American biotechnology company Plexxikon, American pharmaceutical company American Regent, German biotechnology company U3 Pharma, and recently sold Ranbaxy Laboratories in India. Daiichi Sankyo Co., Ltd. is the producer of Benicar, an angiotensin II receptor antagonist and top selling drug in the U.S. Global sales of Olmesartan in 2013 were 300.2 billion yen. Daiichi Sankyo, Inc. began operating in the U.S. in 2006. It is the U.S. subsidiary of Daiichi Sankyo Company, Limited, and a member of the Daiichi Sankyo Group. The organization, which includes U.S. commercial operations and global clinical development, is headquartered in Basking Ridge, New Jersey. Daiichi Sankyo Europe, GmbH, the European subsidiary, is headquartered in Munich, Germany. The organization is responsible for development and manufacturing for 12 European countries."},
{"name": ["Vatti Corp Ltd"], "stock_Value": ["¥6.37"], "time": ["Nov 24, 4:29:49 PM GMT+8 · CNY · SHE ·"], "previous_close": ["¥6.41"], "day_range": ["¥6.32 - ¥6.44"], "volume": ["¥5.28 - ¥7.63"], "market_segment": ["10.34M"], "info": "Vatti is a Chinese company which manufactures kitchen appliances. It manufactures gas hobs, water heaters and extractor fans."},
{"name": ["Evogene Ltd"], "stock_Value": ["ILA 222.20"], "time": ["Nov 23, 5:24:17 PM GMT+2 · ILA · TLV ·"], "previous_close": ["ILA 222.80"], "day_range": ["ILA 212.40 - ILA 226.00"], "volume": ["ILA 189.30 - ILA 610.40"], "market_segment": ["85.97K"], "info": "Evogene is a computational biology company based in Israel. Evogene Ltd. has developed a unique computational predictive biology \"CPB\" platform, which leverages big data with advanced algorithms such as machine learning and other artificial intelligence, while adding a deep understanding of biology and advanced biological technologies. Evogene is using its proprietary CPB platform to computationally design and develop next-generation life-science products based upon three core components: microbes, small molecules, and genetic elements. Evogene's computational platform allows it to substantially increase the probability of successful life-science product development, increase the efficacy and reduce the toxicity of its life-science products while reducing time and cost to development. Its strategic partners include BASF, Bayer, Corteva, ICL Group Ltd. as well as various academic and medical institutions."},
{"name": ["Geo-Jade Petroleum Corp"], "stock_Value": ["¥2.63"], "time": ["Nov 24, 4:00:03 PM GMT+8 · CNY · SHA ·"], "previous_close": ["¥2.66"], "day_range": ["¥2.61 - ¥2.67"], "volume": ["¥2.15 - ¥3.05"], "market_segment": ["14.86M"], "info": "Geo-Jade Petroleum is a Chinese real estate development and oil exploration and production company with oilfields in Kazakhstan as well as exploration activity in Kazakhstan and Russia. The company has made two major acquisitions in 2014–15. In December 2014 it completed the acquisition of 95% of the shares of Maten Petroleum for $526 million. Maten Petroleum's main assets are located in three oil field blocks in production in Kazakhstan, the Matin, Eastern Kokarna and Kara-Arna oil fields. In the other deal, in January 2015 the company announced a $400 million acquisition of Kozhan JSC, an oil producing company in Kazkahstan with rights to develop the Morskoye, Karatal, Dauletally fields in Atyrau Oblast. The company's stock is listed in the Shanghai Stock Exchange since October 8, 1996."},
{"name": ["Bossa Ticaret ve Sanayi Isletmeleri TAS"], "stock_Value": ["₺10.69"], "time": ["Nov 24, 5:36:52 PM GMT+3 · TRY · IST ·"], "previous_close": ["₺10.45"], "day_range": ["₺10.38 - ₺11.38"], "volume": ["₺5.49 - ₺13.20"], "market_segment": ["1.21M"], "info": "Bossa Ticaret ve Sanayi Isletmeleri T.A.S. is a Turkish textile corporation. Bossa's shares are listed on Borsa Istanbul since 1995. 88% of the total amount of shares are owned by Mr. Israfil Ucurum and Mr. Yusuf Ucurum."},
{"name": ["Ventas Inc Bdr"], "stock_Value": ["R$102.70"], "time": ["Nov 24, 11:32:02 AM GMT-3 · BRL · BVMF ·"], "previous_close": ["R$102.70"], "day_range": ["R$102.70 - R$131.29"], "volume": ["17.88B USD"], "market_segment": ["A"], "info": "Ventas, Inc. is a real estate investment trust specializing in the ownership and management of health care facilities in the United States, Canada and the United Kingdom. As of December 2019, the group's portfolio consisted of 1,200 properties divided among nursing homes, medical office buildings, rehabilitation and acute care centres, special care centres, laboratories and research centres and medical-surgical centres for a total value of nearly $25 billion. As of 2019, it is a Fortune 1000 corporation."},
{"name": ["Monster Beverage Corp Bdr"], "stock_Value": ["R$33.80"], "time": ["Nov 24, 11:34:26 AM GMT-3 · BRL · BVMF ·"], "previous_close": ["R$33.63"], "day_range": ["R$33.80 - R$33.80"], "volume": ["R$29.96 - R$38.51"], "market_segment": ["6.85K"], "info": "Monster Beverage Corporation is an American beverage company that manufactures energy drinks including Monster Energy, Relentless and Burn. The company was originally founded as Hansen's in 1935 in Southern California, originally selling juice products. The company renamed itself as Monster Beverage in 2012, and then sold their Hansen's juices and sodas and their other non-energy drink brands to the Coca-Cola Company in 2015. As of 2020, Monster held 39% of the $86 billion global energy drink market, the second highest share after Red Bull."},
{"name": ["Hanwha Aerospace Co Ltd"], "stock_Value": ["₩120,100.00"], "time": ["Nov 24, 6:26:28 PM GMT+9 · KRW · KRX ·"], "previous_close": ["₩121,900.00"], "day_range": ["₩120,000.00 - ₩122,300.00"], "volume": ["₩65,000.00 - ₩151,000.00"], "market_segment": ["466.69K"], "info": "Hanwha Aerospace Co., Ltd., formerly Hanwha Techwin Co Ltd, is a subsidiary of Hanwha Group, is an aerospace industrial company headquartered in Changwon, South Korea. It was established in 1977 as Samsung Precision. The company is Korea's only gas turbine engine manufacturer, and specializes in the development, production and maintenance of aircraft engines. In 1979, it started the aircraft engine business with gas turbine engine depot maintenance business, providing various gas turbine solutions to Korea and all over the world and by 2016 the company had produced more than 8,000 pieces of equipment."},
{"name": ["Jetcom Ord Shs"], "stock_Value": ["$0.00"], "time": ["Jul 14, 7:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$0.00"], "day_range": ["-"], "volume": ["-"], "market_segment": ["2014"], "info": "Jet.com was an American e-commerce company headquartered in Hoboken, New Jersey. The company was co-founded in 2014 by Marc Lore, along with Mike Hanrahan and Nate Faust. Jet.com raised $820 million over four venture rounds from GV, Goldman Sachs, Bain Capital Ventures, Accel Partners, Alibaba Group, and Fidelity. The website was formally launched in July 2015. In September 2016, it became a subsidiary of Walmart. In June 2019, in the wake of slumping sales through the Jet.com site in the period following the acquisition, the majority of Jet.com employees were transferred to work on the Walmart.com site and Simon Belsham, the president of Jet.com, stepped down. On May 19, 2020, Walmart announced that it was shutting down Jet.com, which they did on June 4, directing visitors to use Walmart.com instead."},
{"name": ["Koenig & Bauer AG"], "stock_Value": ["€11.00"], "time": ["Nov 24, 3:02:10 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€11.20"], "day_range": ["€10.92 - €11.30"], "volume": ["€9.93 - €20.20"], "market_segment": ["19.86"], "info": "Koenig & Bauer AG is a German company that makes printing presses based in Würzburg. It was founded by Friedrich Koenig and Andreas Friedrich Bauer in Würzburg in 1817, making it the oldest printing press manufacturer in the world still in service. 95% of the banknotes used in the world are printed on printers made by Koenig & Bauer Banknote Solutions SA, a division of Koenig & Bauer."},
{"name": ["Visteon Corp"], "stock_Value": ["$118.53"], "time": ["Nov 24, 9:51:40 AM GMT-5 · USD · NASDAQ ·"], "previous_close": ["$117.98"], "day_range": ["$117.51 - $118.55"], "volume": ["$108.66 - $171.66"], "market_segment": ["375.23K"], "info": "Visteon Corporation is an American global automotive electronics supplier based in Van Buren Township, Michigan. Visteon designs, engineers, and manufactures vehicle cockpit electronics products, connected car services and electrification products for a diversified customer base, including nearly all of the major automakers worldwide."},
{"name": ["Wharf Holdings ADR"], "stock_Value": ["$5.40"], "time": ["Nov 24, 9:30:01 AM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$5.40"], "day_range": ["$4.00 - $6.27"], "volume": ["65.40B HKD"], "market_segment": ["1886"], "info": "The Wharf (Holdings) Limited, or Wharf in short, is a company founded in 1886 in Hong Kong. As its name suggests, the company's original business was in running wharfage and dockside warehousing, and it was originally known as The Hong Kong and Kowloon Wharf and Godown Company, Limited and founded by Sir Paul Chater. The company adopted its current name in 1986. The current major holder of the company is Wheelock & Co."},
{"name": ["Agricultural Bank of China Unsponsored China ADR"], "stock_Value": ["$9.24"], "time": ["Nov 24, 9:30:01 AM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$9.24"], "day_range": ["$7.93 - $10.41"], "volume": ["1.34T HKD"], "market_segment": ["Feb 23, 1979"], "info": "Agricultural Bank of China, also known as AgBank, is one of the \"Big Four\" banks in China. It was founded on 10 July 1951, and has its headquarters in Dongcheng District, Beijing. It has branches throughout mainland China, Hong Kong, London, Tokyo, New York, Frankfurt, Sydney, Seoul, and Singapore. ABC has 320 million retail customers, 2.7 million corporate clients, and nearly 24,000 branches. It is China's third-largest lender by assets. ABC went public in mid-2010, fetching the world's biggest ever initial public offering at the time, since overtaken by the Saudi Arabian state-run petroleum enterprise, Saudi Aramco. In 2011, it ranked eighth among the Top 1000 World Banks, by 2015, it ranked third in Forbes' 13th annual Global 2000 list and in 2017 it ranked fifth. It is considered a systemically important bank by the Financial Stability Board."},
{"name": ["Grupo Aeroportuario dl Srst SAB CV"], "stock_Value": ["$235.04"], "time": ["Nov 24, 9:51:09 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$235.67"], "day_range": ["$235.04 - $235.04"], "volume": ["$165.00 - $314.48"], "market_segment": ["53.75K"], "info": "Grupo Aeroportuario del Sureste, S.A.B. de C.V., known as ASUR, is a Mexican airport operator headquartered in Mexico City, Mexico. It operates 9 airports in the southeastern states of Mexico, including that of Cancún. It is the third largest airport services company by passenger traffic in Mexico. It serves approximately 23 million passengers annually. ASUR is listed on the Mexican Stock Exchange and in the NYSE. It is a constituent of the IPC, the main benchmark index of the Mexican Stock Exchange."},
{"name": ["Tokyo Electric Power Company Holdngs Inc"], "stock_Value": ["$4.21"], "time": ["Nov 22, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$4.37"], "day_range": ["$4.21 - $4.21"], "volume": ["$3.29 - $4.73"], "market_segment": ["2.79K"], "info": "Tokyo Electric Power Company Holdings, Incorporated is a Japanese electric utility holding company servicing Japan's Kantō region, Yamanashi Prefecture, and the eastern portion of Shizuoka Prefecture. This area includes Tokyo. Its headquarters are located in Uchisaiwaicho, Chiyoda, Tokyo, and international branch offices exist in Washington, D.C., and London. It is a founding member of strategic consortiums related to energy innovation and research; such as JINED, INCJ and MAI. In 2007, TEPCO was forced to shut the Kashiwazaki-Kariwa Nuclear Power Plant after the Niigata-Chuetsu-Oki earthquake. That year it posted its first loss in 28 years. Corporate losses continued until the plant reopened in 2009. Following the 2011 Tōhoku earthquake and tsunami, one of its power plants was the site of one of the world's most serious ongoing nuclear disasters, the Fukushima Daiichi nuclear disaster. TEPCO could face ¥2 trillion in special losses in the current business year to March 2012, and the Japanese government plans to put TEPCO under effective state control to guarantee compensation payments to the people affected by the accident."},
{"name": ["Godrej Agrovet Ltd"], "stock_Value": ["₹495.00"], "time": ["Nov 24, 4:01:26 PM GMT+5:30 · INR · BOM ·"], "previous_close": ["₹503.20"], "day_range": ["₹495.00 - ₹509.80"], "volume": ["₹391.20 - ₹528.00"], "market_segment": ["26.57"], "info": "Godrej Agrovet Limited is an Indian company which operates in the animal feed and agribusiness sectors. The company, which is part of the highly diversified Godrej Group, had a turnover of around Rs. 3100 Cr in FY 2012–13. Godrej Agrovet's chairman is Nadir Godrej. The company's subsidiary, Astec LifeSciences, manufactures agrochemicals."},
{"name": ["Bambuser AB"], "stock_Value": ["kr 1.17"], "time": ["Nov 24, 3:30:19 PM GMT+1 · SEK · STO ·"], "previous_close": ["kr 1.14"], "day_range": ["kr 1.13 - kr 1.18"], "volume": ["kr 0.85 - kr 4.50"], "market_segment": ["324.42K"], "info": "Bambuser AB is a Swedish Company founded in 2007. Bambuser provides a video commerce platform for brands looking to provide engaging and personalized shopping experiences. Bambusee is a global brand headquartered in Stockholm, Sweden. In May 2017, Bambuser was listed on Nasdaq First North stock exchange."},
{"name": ["Wacker Neuson SE"], "stock_Value": ["€16.70"], "time": ["Nov 24, 2:11:53 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€16.56"], "day_range": ["€16.70 - €16.70"], "volume": ["€16.01 - €24.30"], "market_segment": ["5.39"], "info": "Wacker Neuson SE with headquarters in Munich, Germany, is a manufacturer of construction equipment and compact machines for concrete and construction site technology listed on the stock market. The group includes the product brands Wacker Neuson, Kramer and Weidemann. The family business, founded in 1848, employs around 6,000 people worldwide."},
{"name": ["Haulotte Group SA"], "stock_Value": ["€2.47"], "time": ["Nov 24, 2:07:41 PM GMT+1 · EUR · EPA ·"], "previous_close": ["€2.52"], "day_range": ["€2.45 - €2.54"], "volume": ["€2.06 - €3.85"], "market_segment": ["14.61K"], "info": "Haulotte Group is a major French aerial work platform manufacturer, the third-largest company in the world in this area of products."},
{"name": ["Jai Balaji Industries Ltd."], "stock_Value": ["₹593.00"], "time": ["Nov 24, 5:13:24 PM GMT+5:30 · INR · NSE ·"], "previous_close": ["₹605.40"], "day_range": ["₹585.05 - ₹611.90"], "volume": ["₹39.05 - ₹641.90"], "market_segment": ["25.82"], "info": "Jai Balaji Group is a steel manufacturer with Captive Power Generation and plants in nine locations. It also has plans to set up a Mega Steel, Cement and Power Project at Raghunathpur. The group has a presence at Raniganj, Liluah and Rourkela. In 2011, the company bought Nilachal Iron & Power, which is based in Saraikela."},
{"name": ["Exasol AG"], "stock_Value": ["€2.58"], "time": ["Nov 24, 3:12:51 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€2.56"], "day_range": ["€2.53 - €2.58"], "volume": ["€1.95 - €4.74"], "market_segment": ["-"], "info": "Exasol is an analytics database management software company. Its product is called Exasol, an in-memory, column-oriented, relational database management system Since 2008, Exasol led the Transaction Processing Performance Council's TPC-H benchmark for analytical scenarios, in all data volume-based categories 100 GB, 300 GB, 1 TB, 3 TB, 10 TB, 30 TB and 100 TB. Exasol holds the top position in absolute performance as well as price/performance. The database company used to be included as a niche player in Gartner's \"Magic Quadrant for Data Warehouse Database Management Systems\". It has not been included since 2016. The 2021 \"Gartner Magic Quadrant for Cloud Database Management Systems\" includes Exasol as a niche player again."},
{"name": ["Tennant Co"], "stock_Value": ["$87.40"], "time": ["Nov 24, 9:43:54 AM GMT-5 · USD · NYSE ·"], "previous_close": ["$87.19"], "day_range": ["$58.59 - $89.53"], "volume": ["1.64B USD"], "market_segment": ["16.00"], "info": "The Tennant Company is a company with about 4000 employees that provides cleaning products. It is a company that is listed in the New York Stock Exchange."},
{"name": ["BSP Financial Group Ltd"], "stock_Value": ["$5.30"], "time": ["Nov 24, 7:00:00 PM GMT+11 · AUD · ASX ·"], "previous_close": ["$5.30"], "day_range": ["$5.30 - $5.35"], "volume": ["$4.52 - $6.01"], "market_segment": ["5.85K"], "info": "BSP Financial Group Limited is the largest bank in Papua New Guinea, with 121 branches throughout the country and in 7 countries. BSP currently services over 650,000 business banking customers throughout the Pacific. As at 31 December 2022, BSP had total assets valued at K33.9 billion. Bank South Pacific is listed on the PNG Exchange Markets and, as of 25 May 2021, the Australian Securities Exchange."},
{"name": ["NAGA Group AG"], "stock_Value": ["€1.10"], "time": ["Nov 24, 2:15:39 PM GMT+1 · EUR · FRA ·"], "previous_close": ["€1.09"], "day_range": ["€1.10 - €1.10"], "volume": ["€1.00 - €2.81"], "market_segment": ["-"], "info": "NAGA Group is a German fintech company that provides an investing app with an inbuilt social network. The company's headquarters is located in Hamburg, Germany. It was listed on the Frankfurt Stock Exchange in 2017. The NAGA Group AG is the holding company of NAGA Markets Europe Ltd, NAGA Technology GmbH, and NAGA Global Ltd."},
{"name": ["DS Smith plc"], "stock_Value": ["$3.25"], "time": ["Nov 8, 8:10:00 PM GMT-5 · USD · OTCMKTS ·"], "previous_close": ["$3.25"], "day_range": ["$3.21 - $4.18"], "volume": ["3.86B GBP"], "market_segment": ["-"], "info": "DS Smith plc is a British multinational packaging business, headquartered in London, England. It is listed on the London Stock Exchange and is a constituent of the FTSE 100 Index."},
{"name": ["Wells Fargo & Co"], "stock_Value": ["€39.10"], "time": ["Nov 24, 2:57:26 PM GMT+1 · EUR · ETR ·"], "previous_close": ["€39.34"], "day_range": ["€39.10 - €39.10"], "volume": ["€33.20 - €46.25"], "market_segment": ["164.00"], "info": "Wells Fargo & Company is an American multinational financial services company with a significant global presence. The company operates in 35 countries and serves over 70 million customers worldwide. It is a systemically important financial institution according to the Financial Stability Board, and is considered one of the \"Big Four Banks\" in the United States, alongside JPMorgan Chase, Bank of America, and Citigroup. The firm's primary subsidiary is Wells Fargo Bank, N.A., a national bank that designates its Sioux Falls, South Dakota, site as its main office. It is the fourth-largest bank in the United States by total assets and is also one of the largest as ranked by bank deposits and market capitalization. It has 8,050 branches and 13,000 automated teller machines and 2,000 stand-alone mortgage branches. It is the second largest retail mortgage originator in the United States, originating one out of every four home loans and services $1.8 trillion in home mortgages, one of the largest servicing portfolios in the US. It is one of the most valuable bank brands. Wells Fargo is ranked 47th on the Fortune 500 list of the largest companies in the U.S."}
]